-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 opened on:  22 May 2025, 15:33:25

. 
. di "$projectdir"
/workspace

. di "$logdir"
/workspace/logs

. 
. import delimited "$projectdir/output/dataset.csv", clear
(88 vars, 3,571 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "/usr/local/stata/ado/base/"
  [2]  (SITE)      "/usr/local/ado/"
  [3]              "."
  [4]  (PERSONAL)  "~/ado/personal/"
  [5]  (PLUS)      "~/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/workspace/analysis/extra_ados"

. 
. **Set index dates ===========================================================
> */
. global year_preceding = "01/04/2015"

. global start_date = "01/04/2016" //for outpatient analyses, data may only be 
> available from April 2019

. global end_date = "31/03/2025"

. global base_year = year(date("$start_date", "DMY"))

. global end_year = year(date("$end_date", "DMY"))

. global max_year = $end_year - $base_year

. 
. **Conversion for dates====================================================*
. 
. ***Variables ending in _date that are string
. ds *_date, has(type string)
eia_code_d~e  haem_ca_be~e  solid_ca_a~e  rheum~y_date  metho~j_date
ra_code_date  ckd_before~e  haem_ca_af~e  rheum~2_date  sulfasalaz~e
psa_code_d~e  depr_befor~e  ckd_after_~e  rheum~3_date  hydroxychl~e
anksp_code~e  osteop_bef~e  depr_after~e  rheum~4_date  rtt_cl_sta~e
undiff_cod~e  frac_befor~e  osteop_aft~e  r~eappt_date  rtt_cl_ref~e
chd_before~e  dem_before~e  frac_after~e  rheum~e_date  rtt_cl_end~e
dm_before_~e  chd_after_~e  dem_after_~e  ~erheum_date  rtt_op_sta~e
ild_before~e  dm_after_d~e  creatinin~te  l~ecode_date  rtt_op_ref~e
copd_befor~e  ild_after_~e  rf_date       ~frheum_date  rtt_op_end~e
cva_before~e  copd_after~e  bmi_date      l~fcode_date
lung_ca_be~e  cva_after_~e  r~_appt_date  leflunomid~e
solid_ca_b~e  lung_ca_af~e  rheum~f_date  metho~l_date

. local string_dates `r(varlist)'

. foreach var of local string_dates {
  2.     gen `var'_num = date(`var', "YMD")
  3.     format `var'_num %td
  4.     order `var'_num, after(`var')
  5.     drop `var'
  6.     rename `var'_num `var'
  7. }
(604 missing values generated)
(3,186 missing values generated)
(3,318 missing values generated)
(3,510 missing values generated)
(3,131 missing values generated)
(3,351 missing values generated)
(3,194 missing values generated)
(3,497 missing values generated)
(3,183 missing values generated)
(3,109 missing values generated)
(715 missing values generated)
(2,478 missing values generated)
(3,070 missing values generated)
(3,419 missing values generated)
(3,514 missing values generated)
(3,568 missing values generated)
(3,144 missing values generated)
(2,997 missing values generated)
(3,332 missing values generated)
(3,164 missing values generated)
(3,460 missing values generated)
(3,080 missing values generated)
(2,995 missing values generated)
(411 missing values generated)
(2,329 missing values generated)
(2,901 missing values generated)
(3,375 missing values generated)
(3,494 missing values generated)
(3,567 missing values generated)
(3,015 missing values generated)
(3,554 missing values generated)
(3,557 missing values generated)
(3,570 missing values generated)
(2,362 missing values generated)
(2,362 missing values generated)
(1,399 missing values generated)
(1,731 missing values generated)
(1,193 missing values generated)
(721 missing values generated)
(3,561 missing values generated)
(3,539 missing values generated)
(2,896 missing values generated)
(1,557 missing values generated)
(3,568 missing values generated)
(3,560 missing values generated)
(2,059 missing values generated)
(935 missing values generated)
(630 missing values generated)
(1,783 missing values generated)
(1,316 missing values generated)
(1,415 missing values generated)
(1,415 missing values generated)
(1,415 missing values generated)
(1,393 missing values generated)
(1,393 missing values generated)
(1,393 missing values generated)

. 
. ***Variables ending in _date that are numeric
. foreach var of varlist *_date {
  2.     capture confirm string variable `var'
  3.     if _rc != 0 {
  4.         format `var' %td
  5.     }
  6. }

. 
. ***Create binary indicator for each
. ds *_date
eia_code_d~e  haem_ca_be~e  solid_ca_a~e  rheum~y_date  metho~j_date
ra_code_date  ckd_before~e  haem_ca_af~e  rheum~2_date  sulfasalaz~e
psa_code_d~e  depr_befor~e  ckd_after_~e  rheum~3_date  hydroxychl~e
anksp_code~e  osteop_bef~e  depr_after~e  rheum~4_date  rtt_cl_sta~e
undiff_cod~e  frac_befor~e  osteop_aft~e  r~eappt_date  rtt_cl_ref~e
chd_before~e  dem_before~e  frac_after~e  rheum~e_date  rtt_cl_end~e
dm_before_~e  chd_after_~e  dem_after_~e  ~erheum_date  rtt_op_sta~e
ild_before~e  dm_after_d~e  creatinin~te  l~ecode_date  rtt_op_ref~e
copd_befor~e  ild_after_~e  rf_date       ~frheum_date  rtt_op_end~e
cva_before~e  copd_after~e  bmi_date      l~fcode_date
lung_ca_be~e  cva_after_~e  r~_appt_date  leflunomid~e
solid_ca_b~e  lung_ca_af~e  rheum~f_date  metho~l_date

. local dates `r(varlist)'

. foreach var of local dates {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. /*
> **Will also need to amend conversion for biologic dates =====================
> ===============================*
> ***Some dates are given with month/year only, so adding day 15 to enable them
>  to be processed as dates 
> 
> foreach var of varlist   abatacept_date                                      
>    ///
>                                                  adalimumab_date             
>                            ///     
>                                                  baricitinib_date            
>                            ///
>                                                  certolizumab_date           
>                            ///
>                                                  etanercept_date             
>                            ///
>                                                  golimumab_date              
>                            ///
>                                                  guselkumab_date             
>                            ///     
>                                                  infliximab_date             
>                            ///
>                                                  ixekizumab_date             
>                            ///
>                                                  methotrexate_hcd_date       
>                    ///
>                                                  rituximab_date              
>                            ///
>                                                  sarilumab_date              
>                            ///
>                                                  secukinumab_date            
>                            ///     
>                                                  tocilizumab_date            
>                            ///
>                                                  tofacitinib_date            
>                            ///
>                                                  upadacitinib_date           
>                            ///
>                                                  ustekinumab_date            
>                            ///
>                                                  {
>                                                         
>                 capture confirm string variable `var'
>                 if _rc!=0 {
>                         assert `var'==.
>                         rename `var' `var'_date
>                 }
>         
>                 else {
>                                 replace `var' = `var' + "-15"
>                                 rename `var' `var'_dstr
>                                 replace `var'_dstr = " " if `var'_dstr == "-1
> 5"
>                                 gen `var'_date = date(`var'_dstr, "YMD") 
>                                 order `var'_date, after(`var'_dstr)
>                                 drop `var'_dstr
>                 }
>         
>         format `var'_date %td
> }
> */
.                                          
. **Create and label variables ================================================
> ===========*/
. 
. ***Age variables
. *Create categorised age
. drop if age<18 & age !=.
(0 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age at diagnosis"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(3571 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      1,529       42.82       42.82
      40-49 |        511       14.31       57.13
      50-59 |        491       13.75       70.88
      60-69 |        362       10.14       81.01
      70-79 |        281        7.87       88.88
        80+ |        397       11.12      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. order agegroup, after(age)

. 
. ***Sex
. gen male = 1 if sex == "male"
(1,791 missing values generated)

. replace male = 0 if sex == "female"
(1,791 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,791       50.15       50.15
        Yes |      1,780       49.85      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. order male, after(sex)

. 
. ***Ethnicity
. gen ethnicity_n = 1 if ethnicity == "White"
(3,221 missing values generated)

. replace ethnicity_n = 2 if ethnicity == "Asian or Asian British"
(258 real changes made)

. replace ethnicity_n = 3 if ethnicity == "Black or Black British"
(261 real changes made)

. replace ethnicity_n = 4 if ethnicity == "Mixed"
(160 real changes made)

. replace ethnicity_n = 5 if ethnicity == "Chinese or Other Ethnic Groups"
(389 real changes made)

. replace ethnicity_n = 6 if ethnicity == "Unknown"
(2,153 real changes made)

. 
. 
. label define ethnicity_n        1 "White"                                    
>            ///
>                                                         2 "Asian or Asian Bri
> tish"              ///
>                                                         3 "Black or Black Bri
> tish"      ///
>                                                         4 "Mixed"            
>                                    ///
>                                                         5 "Chinese or Other E
> thnic Groups" ///
>                                                         6 "Not known", modify

.                                                         
. label values ethnicity_n ethnicity_n

. lab var ethnicity_n "Ethnicity"

. tab ethnicity_n, missing

                     Ethnicity |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                         White |        350        9.80        9.80
        Asian or Asian British |        258        7.22       17.03
        Black or Black British |        261        7.31       24.33
                         Mixed |        160        4.48       28.82
Chinese or Other Ethnic Groups |        389       10.89       39.71
                     Not known |      2,153       60.29      100.00
-------------------------------+-----------------------------------
                         Total |      3,571      100.00

. drop ethnicity

. rename ethnicity_n ethnicity 

. 
. ***Practice regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |        390       10.92       10.92
           East Midlands |        377       10.56       21.48
                  London |        372       10.42       31.90
              North East |        399       11.17       43.07
              North West |        390       10.92       53.99
              South East |        403       11.29       65.28
              South West |        406       11.37       76.65
           West Midlands |        413       11.57       88.21
Yorkshire and The Humber |        421       11.79      100.00
-------------------------+-----------------------------------
                   Total |      3,571      100.00

. replace region="Not known" if region==""
(0 real changes made)

. gen region_nospace=region

. replace region_nospace="SouthWest" if region=="South West"
(406 real changes made)

. replace region_nospace="EastMidlands" if region=="East Midlands"
(377 real changes made)

. replace region_nospace="East" if region=="East"
(0 real changes made)

. replace region_nospace="London" if region=="London"
(0 real changes made)

. replace region_nospace="NorthEast" if region=="North East"
(399 real changes made)

. replace region_nospace="NorthWest" if region=="North West"
(390 real changes made)

. replace region_nospace="SouthEast" if region=="South East"
(403 real changes made)

. replace region_nospace="WestMidlands" if region=="West Midlands"
(413 real changes made)

. replace region_nospace="YorkshireandTheHumber" if region=="Yorkshire and The 
> Humber"
(421 real changes made)

. 
. ***IMD
. gen imd = 1 if imd_quintile == "1 (most deprived)"
(2,899 missing values generated)

. replace imd = 2 if imd_quintile == "2"
(704 real changes made)

. replace imd = 3 if imd_quintile == "3"
(634 real changes made)

. replace imd = 4 if imd_quintile == "4"
(669 real changes made)

. replace imd = 5 if imd_quintile == "5 (least deprived)"
(674 real changes made)

. replace imd = .u if imd_quintile == "Unknown"
(218 real changes made, 218 to missing)

. lab var imd "Index of multiple deprivation"

. lab define imd 1 "1 (most deprived)" ///
>                            2 "2" ///
>                            3 "3" ///
>                            4 "4" ///
>                            5 "5 (least deprived)" ///
>                            .u "Not known"

. lab val imd imd                    

. tab imd, missing

 Index of multiple |
       deprivation |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |        672       18.82       18.82
                 2 |        704       19.71       38.53
                 3 |        634       17.75       56.29
                 4 |        669       18.73       75.02
5 (least deprived) |        674       18.87       93.90
         Not known |        218        6.10      100.00
-------------------+-----------------------------------
             Total |      3,571      100.00

. drop imd_quintile

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(0 real changes made)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(0 real changes made)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(3,570 missing values generated)

. gen bmi_age = age - bmi_time
(3,570 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(0 real changes made)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(0 real changes made)

. replace bmi_time = . if bmi_value == . 
(0 real changes made)

. replace bmi_age = . if bmi_value == . 
(0 real changes made)

. 
. *Create BMI categories
. gen     bmicat = .
(3,571 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(bmicat: 0 changes made)

. recode  bmicat . = 2 if bmi_value < 25
(bmicat: 1 changes made)

. recode  bmicat . = 3 if bmi_value < 30
(bmicat: 0 changes made)

. recode  bmicat . = 4 if bmi_value < 35
(bmicat: 0 changes made)

. recode  bmicat . = 5 if bmi_value < 40
(bmicat: 0 changes made)

. recode  bmicat . = 6 if bmi_value < .
(bmicat: 0 changes made)

. replace bmicat = .u if bmi_value >= .
(3,570 real changes made, 3,570 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Not known"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  Normal (18.5-24.9) |          1        0.03        0.03
           Not known |      3,570       99.97      100.00
---------------------+-----------------------------------
               Total |      3,571      100.00

. order bmicat, after (bmi_value)

. drop bmi_age bmi_time

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(3571 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Not known"

. 
. gen     smoke = 1  if smoking_status == "N"
(3,528 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,380 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,142 real changes made)

. replace smoke = .u if smoking_status == "M"
(6 real changes made, 6 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |         43        1.20        1.20
     Former |      1,380       38.64       39.85
    Current |      2,142       59.98       99.83
  Not known |          6        0.17      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing 
> smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(6 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***Nb. not using creatinine of HBA1c values for now, just codes
. foreach disease in ckd dm ild copd cva lung_ca solid_ca haem_ca depr osteop f
> rac dem chd {
  2.         label define `disease'_before 0 "No" 1 "Yes"
  3.         label values `disease'_before `disease'_before
  4.         tab `disease'_before, missing
  5.         label define `disease'_after 0 "No" 1 "Yes"
  6.         label values `disease'_after `disease'_after
  7.         tab `disease'_after, missing
  8.         gen `disease'_new = 1 if (`disease'_after == 1 & `disease'_before 
> == 0)
  9.         recode `disease'_new .=0
 10.         label define `disease'_new 0 "No" 1 "Yes"
 11.         label values `disease'_new `disease'_new
 12.         tab `disease'_new, missing
 13.         order `disease'_new, after(`disease'_after)
 14. }

 ckd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,070       85.97       85.97
        Yes |        501       14.03      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  ckd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,901       81.24       81.24
        Yes |        670       18.76      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(2,981 missing values generated)
(ckd_new: 2981 changes made)

    ckd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,981       83.48       83.48
        Yes |        590       16.52      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  dm_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,351       93.84       93.84
        Yes |        220        6.16      100.00
------------+-----------------------------------
      Total |      3,571      100.00

   dm_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,332       93.31       93.31
        Yes |        239        6.69      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,343 missing values generated)
(dm_new: 3343 changes made)

     dm_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,343       93.62       93.62
        Yes |        228        6.38      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 ild_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,194       89.44       89.44
        Yes |        377       10.56      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  ild_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,164       88.60       88.60
        Yes |        407       11.40      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,194 missing values generated)
(ild_new: 3194 changes made)

    ild_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,194       89.44       89.44
        Yes |        377       10.56      100.00
------------+-----------------------------------
      Total |      3,571      100.00

copd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,497       97.93       97.93
        Yes |         74        2.07      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 copd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,460       96.89       96.89
        Yes |        111        3.11      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,461 missing values generated)
(copd_new: 3461 changes made)

   copd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,461       96.92       96.92
        Yes |        110        3.08      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 cva_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,183       89.13       89.13
        Yes |        388       10.87      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  cva_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,080       86.25       86.25
        Yes |        491       13.75      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,121 missing values generated)
(cva_new: 3121 changes made)

    cva_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,121       87.40       87.40
        Yes |        450       12.60      100.00
------------+-----------------------------------
      Total |      3,571      100.00

lung_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,109       87.06       87.06
        Yes |        462       12.94      100.00
------------+-----------------------------------
      Total |      3,571      100.00

lung_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,995       83.87       83.87
        Yes |        576       16.13      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,049 missing values generated)
(lung_ca_new: 3049 changes made)

lung_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,049       85.38       85.38
        Yes |        522       14.62      100.00
------------+-----------------------------------
      Total |      3,571      100.00

solid_ca_be |
       fore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        715       20.02       20.02
        Yes |      2,856       79.98      100.00
------------+-----------------------------------
      Total |      3,571      100.00

solid_ca_af |
        ter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        411       11.51       11.51
        Yes |      3,160       88.49      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(2,929 missing values generated)
(solid_ca_new: 2929 changes made)

solid_ca_ne |
          w |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,929       82.02       82.02
        Yes |        642       17.98      100.00
------------+-----------------------------------
      Total |      3,571      100.00

haem_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,478       69.39       69.39
        Yes |      1,093       30.61      100.00
------------+-----------------------------------
      Total |      3,571      100.00

haem_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,329       65.22       65.22
        Yes |      1,242       34.78      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(2,653 missing values generated)
(haem_ca_new: 2653 changes made)

haem_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,653       74.29       74.29
        Yes |        918       25.71      100.00
------------+-----------------------------------
      Total |      3,571      100.00

depr_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,419       95.74       95.74
        Yes |        152        4.26      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 depr_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,375       94.51       94.51
        Yes |        196        5.49      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,385 missing values generated)
(depr_new: 3385 changes made)

   depr_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,385       94.79       94.79
        Yes |        186        5.21      100.00
------------+-----------------------------------
      Total |      3,571      100.00

osteop_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,514       98.40       98.40
        Yes |         57        1.60      100.00
------------+-----------------------------------
      Total |      3,571      100.00

osteop_afte |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,494       97.84       97.84
        Yes |         77        2.16      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,495 missing values generated)
(osteop_new: 3495 changes made)

 osteop_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,495       97.87       97.87
        Yes |         76        2.13      100.00
------------+-----------------------------------
      Total |      3,571      100.00

frac_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,568       99.92       99.92
        Yes |          3        0.08      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 frac_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,567       99.89       99.89
        Yes |          4        0.11      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,567 missing values generated)
(frac_new: 3567 changes made)

   frac_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,567       99.89       99.89
        Yes |          4        0.11      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 dem_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,144       88.04       88.04
        Yes |        427       11.96      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  dem_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,015       84.43       84.43
        Yes |        556       15.57      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,075 missing values generated)
(dem_new: 3075 changes made)

    dem_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,075       86.11       86.11
        Yes |        496       13.89      100.00
------------+-----------------------------------
      Total |      3,571      100.00

 chd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,131       87.68       87.68
        Yes |        440       12.32      100.00
------------+-----------------------------------
      Total |      3,571      100.00

  chd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,997       83.93       83.93
        Yes |        574       16.07      100.00
------------+-----------------------------------
      Total |      3,571      100.00
(3,053 missing values generated)
(chd_new: 3053 changes made)

    chd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      3,053       85.49       85.49
        Yes |        518       14.51      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. 
. lab var ckd_before "Chronic kidney disease"

. lab var ckd_after "Chronic kidney disease"

. lab var ckd_new "Chronic kidney disease"

. lab var dm_before "Type 2 diabetes mellitus"

. lab var dm_after "Type 2 diabetes mellitus"

. lab var dm_new "Type 2 diabetes mellitus"

. lab var ild_before "Interstitial lung disease"

. lab var ild_after "Interstitial lung disease"

. lab var ild_new "Interstitial lung disease"

. lab var copd_before "COPD"

. lab var copd_after "COPD"

. lab var copd_new "COPD"

. lab var lung_ca_before "Lung cancer"

. lab var lung_ca_after "Lung cancer"

. lab var lung_ca_new "Lung cancer"

. lab var solid_ca_before "Solid organ cancer"

. lab var solid_ca_after "Solid organ cancer"

. lab var solid_ca_new "Solid organ cancer"

. lab var haem_ca_before "Haematological cancer"

. lab var haem_ca_after "Haematological cancer"

. lab var haem_ca_new "Haematological cancer"

. lab var depr_before "Depression"

. lab var depr_after "Depression"

. lab var depr_new "Depression"

. lab var osteop_before "Osteoporosis"

. lab var osteop_after "Osteoporosis"

. lab var osteop_new "Osteoporosis"

. lab var frac_before "Fragility fracture"

. lab var frac_after "Fragility fracture"

. lab var frac_new "Fragility fracture"

. lab var dem_before "Dementia"

. lab var dem_after "Dementia"

. lab var dem_new "Dementia"

. lab var chd_before "Coronary heart disease"

. lab var chd_after "Coronary heart disease"

. lab var chd_new "Coronary heart disease"

. 
. lab var rheum_appt "Rheumatology appointment"

. lab define rheum_appt 0 "No" 1 "Yes", modify

. lab val rheum_appt rheum_appt

. 
. **All patients should have diagnostic code===================================
> ==========================*/
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,571      100.00      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. keep if eia_code==1
(0 observations deleted)

. 
. **Check first rheum appt date was before diagnostic code date================
> ==================*/
. 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient dat
> e (with first attendance option selected) in the 12 months before EIA code ap
> peared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,362       66.14       66.14
        Yes |      1,209       33.86      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. tab rheum_appt if rheum_appt_date>eia_code_date & rheum_appt_date!=. //confir
> m proportion who had first rheum appt (i.e. not missing) after EIA code

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        191      100.00      100.00
------------+-----------------------------------
      Total |        191      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 30) & rheum_appt_date!=. /
> /confirm proportion who had first rheum appt 30 days after EIA code 

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        103      100.00      100.00
------------+-----------------------------------
      Total |        103      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. /
> /confirm proportion who had first rheum appt 60 days after EIA code - should 
> be none
no observations

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_dat
> e!=. //replace as missing if first appt >60 days after EIA code - should be n
> one
(0 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_app
> t_date!=. //replace as missing if first appt >60 days after EIA code - should
>  be none
(0 real changes made)

. 
. **As above - for differently specified rheumatology appointments
. replace rheum_appt_any=0 if rheum_appt_any_date>(eia_code_date + 60) & rheum_
> appt_any_date!=. //replace as missing those appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt_any_date=. if rheum_appt_any_date>(eia_code_date + 60) & r
> heum_appt_any_date!=. //replace as missing those appts >60 days after EIA cod
> e
(0 real changes made)

. replace rheum_appt2=0 if rheum_appt2_date>(eia_code_date + 60) & rheum_appt2_
> date!=. //replace as missing those appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt2_date=. if rheum_appt2_date>(eia_code_date + 60) & rheum_a
> ppt2_date!=. //replace as missing those appts >60 days after EIA code_yea
(0 real changes made)

. replace rheum_appt3=0 if rheum_appt3_date>(eia_code_date + 60) & rheum_appt3_
> date!=. //replace as missing those appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt3_date=. if rheum_appt3_date>(eia_code_date + 60) & rheum_a
> ppt3_date!=. //replace as missing those appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt4=0 if rheum_appt4_date>(eia_code_date + 60) & rheum_appt4_
> date!=. //replace as missing those appts >60 days after EIA code - THIS IS AN
>  IMPORTANT ONE TO CHECK
(472 real changes made)

. replace rheum_appt4_date=. if rheum_appt4_date>(eia_code_date + 60) & rheum_a
> ppt4_date!=. //replace as missing those appts >60 days after EIA code
(472 real changes made, 472 to missing)

. 
. *Check if first csDMARD/biologic was after rheum appt date===================
> ==================================*/
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate_oral==
> 1 | methotrexate_inj==1 | sulfasalazine==1
(234 missing values generated)

. recode csdmard .=0 
(csdmard: 234 changes made)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        234        6.55        6.55
          1 |      3,337       93.45      100.00
------------+-----------------------------------
      Total |      3,571      100.00

. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_
> oral_date, methotrexate_inj_date, sulfasalazine_date)
(234 missing values generated)

. format %td csdmard_date

. 
. **Generate combined methotrexate (primary care only)
. gen mtx = 1 if methotrexate_oral==1 | methotrexate_inj==1
(372 missing values generated)

. recode mtx .=0
(mtx: 372 changes made)

. lab var mtx "Methotrexate"

. gen mtx_date = min(methotrexate_oral_date, methotrexate_inj_date) if mtx == 1
(372 missing values generated)

. format %td mtx_date

. 
. **Exclude if first csdmard was more than 60 days before first rheum appt
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt
> _date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        981      100.00      100.00
------------+-----------------------------------
      Total |        981      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rhe
> um_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        953      100.00      100.00
------------+-----------------------------------
      Total |        953      100.00

. gen pre_ra_csdmard_time = (rheum_appt_date - csdmard_date) if rheum_appt_date
> !=. & csdmard_date!=. & csdmard_date<rheum_appt_date
(2,590 missing values generated)

. tabstat pre_ra_csdmard_time, stats (n mean p50 p25 p75) // how long before we
> re csdmards prescribed

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
pre_ra_csd~e |       981  698.2956       603       321       965
----------------------------------------------------------------

. tab mtx if rheum_appt_date!=. & mtx_date!=. & (mtx_date + 60)<rheum_appt_date
>  

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        823      100.00      100.00
------------+-----------------------------------
      Total |        823      100.00

. tab hydroxychloroquine if rheum_appt_date!=. & hydroxychloroquine_date!=. & (
> hydroxychloroquine_date + 60)<rheum_appt_date 

hydroxychlo |
    roquine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        392      100.00      100.00
------------+-----------------------------------
      Total |        392      100.00

. tab sulfasalazine if rheum_appt_date!=. & sulfasalazine_date!=. & (sulfasalaz
> ine_date + 60)<rheum_appt_date 

sulfasalazi |
         ne |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        294      100.00      100.00
------------+-----------------------------------
      Total |        294      100.00

. tab leflunomide if rheum_appt_date!=. & leflunomide_date!=. & (leflunomide_da
> te + 60)<rheum_appt_date 

leflunomide |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        229      100.00      100.00
------------+-----------------------------------
      Total |        229      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt
> _date //drop if first csDMARD more than 60 days before first attendance at a 
> rheum appt 
(953 observations deleted)

. tab csdmard if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. 
> & (csdmard_date + 60)<rheum_appt_any_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        700      100.00      100.00
------------+-----------------------------------
      Total |        700      100.00

. drop if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. & (csdm
> ard_date + 60)<rheum_appt_any_date //drop if first csDMARD more than 60 days 
> before first captured rheum appt that did not have first attendance tag
(700 observations deleted)

. 
. /*
> **csDMARDs (including high cost MTX)
> gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1
>  | methotrexate_hcd==1 | sulfasalazine==1
> recode csdmard_hcd .=0 
> tab csdmard_hcd, missing
> 
> **Date of first csDMARD script (including high cost MTX prescriptions)
> gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrex
> ate_date, methotrexate_hcd_date, sulfasalazine_date)
> format %td csdmard_hcd_date
> 
> **Biologic use
> gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizuma
> b==1 | etanercept==1 | golimumab==1 | guselkumab==1 | infliximab==1 | ixekizu
> mab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofa
> citinib==1 | upadacitinib==1 | ustekinumab==1 
> recode biologic .=0
> tab biologic, missing
> 
> **Date of first biologic script
> gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, cert
> olizumab_date, etanercept_date, golimumab_date, guselkumab_date, infliximab_d
> ate, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocil
> izumab_date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
> format %td biologic_date
> 
> tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_a
> ppt_date 
> tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<
> rheum_appt_date 
> drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_ap
> pt_date //drop if first biologic more than 60 days before first rheum_appt_da
> te
> tab biologic if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=
> . & (biologic_date + 60)<rheum_appt_any_date
> drop if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=. & (bio
> logic_date + 60)<rheum_appt_any_date //drop if first biologic more than 60 da
> ys before first captured rheum appt that did not have first attendance tag
> */
. 
. *Generate diagnosis date=====================================================
> ==========*/
. 
. **Use diagnostic code date (in GP record) as diagnosis date
. gen diagnosis_date=eia_code_date

. format diagnosis_date %td

. 
. *Refine diagnostic window====================================================
> =========*/
. 
. **Keep patients with diagnosis date after start date and before end date - sh
> ould be none dropped
. keep if diagnosis_date>=date("$start_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,918      100.00      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. keep if diagnosis_date<=date("$end_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,918      100.00      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. *Include only most recent EIA sub-diagnosis==================================
> ===========*/
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(16 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(13 real changes made)

. replace ra_code =0 if undiff_code_date > ra_code_date & undiff_code_date !=.
(3 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(15 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(0 real changes made)

. replace psa_code =0 if undiff_code_date > psa_code_date & undiff_code_date !=
> .
(0 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(1 real change made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(7 real changes made)

. replace anksp_code =0 if undiff_code_date > anksp_code_date & undiff_code_dat
> e !=.
(0 real changes made)

. replace undiff_code =0 if ra_code_date >= undiff_code_date & ra_code_date !=.
(2 real changes made)

. replace undiff_code =0 if psa_code_date >= undiff_code_date & psa_code_date !
> =.
(1 real change made)

. replace undiff_code =0 if anksp_code_date >= undiff_code_date & anksp_code_da
> te !=.
(0 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(355 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(199 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(131 real changes made)

. replace eia_diagnosis=4 if undiff_code==1
(25 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA" 4 "Undiff IA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |      1,563       81.49       81.49
        PsA |        199       10.38       91.87
      AxSpA |        131        6.83       98.70
  Undiff IA |         25        1.30      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. drop if eia_diagnosis==. //should be none
(0 observations deleted)

. 
. decode eia_diagnosis, gen(eia_diag)

. replace eia_diag="Undiff_IA" if eia_diagnosis==4
(25 real changes made)

. 
. *Split into time windows=========================================*/
. 
. **Month/Year of GP diagnostic code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tmMon-CCYY

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. lab var mo_year_diagn "Month/Year of Diagnosis"

. lab var mo_year_diagn_s "Month/Year of Diagnosis"

. 
. **Month/Year of rheum appt
. gen year_appt=year(rheum_appt_date) if rheum_appt_date!=.
(1,662 missing values generated)

. format year_appt %ty

. gen month_appt=month(rheum_appt_date) if rheum_appt_date!=. 
(1,662 missing values generated)

. gen mo_year_appt=ym(year_appt, month_appt)
(1,662 missing values generated)

. format mo_year_appt %tmMon-CCYY

. generate str16 mo_year_appt_s = strofreal(mo_year_appt,"%tmCCYY!mNN")

. 
. **Separate into 3-month time windows (for diagnosis date)
. gen diagnosis_3m = qofd(diagnosis_date)

. format diagnosis_3m %tq

. lab var diagnosis_3m "Time period for diagnosis"

. tab diagnosis_3m, missing

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          9        0.47        0.47
     2016q3 |          4        0.21        0.68
     2016q4 |         11        0.57        1.25
     2017q1 |          5        0.26        1.51
     2017q2 |         18        0.94        2.45
     2017q3 |         11        0.57        3.02
     2017q4 |          9        0.47        3.49
     2018q1 |          9        0.47        3.96
     2018q2 |          8        0.42        4.38
     2018q3 |         13        0.68        5.06
     2018q4 |          9        0.47        5.53
     2019q1 |         10        0.52        6.05
     2019q2 |         19        0.99        7.04
     2019q3 |         15        0.78        7.82
     2019q4 |         14        0.73        8.55
     2020q1 |         10        0.52        9.07
     2020q2 |         16        0.83        9.91
     2020q3 |         14        0.73       10.64
     2020q4 |         29        1.51       12.15
     2021q1 |         19        0.99       13.14
     2021q2 |         26        1.36       14.49
     2021q3 |         34        1.77       16.27
     2021q4 |         28        1.46       17.73
     2022q1 |         39        2.03       19.76
     2022q2 |         50        2.61       22.37
     2022q3 |         56        2.92       25.29
     2022q4 |         81        4.22       29.51
     2023q1 |        100        5.21       34.72
     2023q2 |        103        5.37       40.09
     2023q3 |        136        7.09       47.18
     2023q4 |        135        7.04       54.22
     2024q1 |        168        8.76       62.98
     2024q2 |        165        8.60       71.58
     2024q3 |        173        9.02       80.60
     2024q4 |        179        9.33       89.94
     2025q1 |        193       10.06      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. bys eia_diagnosis: tab diagnosis_3m, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          6        0.38        0.38
     2016q3 |          4        0.26        0.64
     2016q4 |         10        0.64        1.28
     2017q1 |          4        0.26        1.54
     2017q2 |         15        0.96        2.50
     2017q3 |          7        0.45        2.94
     2017q4 |          7        0.45        3.39
     2018q1 |          8        0.51        3.90
     2018q2 |          7        0.45        4.35
     2018q3 |         13        0.83        5.18
     2018q4 |          7        0.45        5.63
     2019q1 |          9        0.58        6.21
     2019q2 |         16        1.02        7.23
     2019q3 |         11        0.70        7.93
     2019q4 |         11        0.70        8.64
     2020q1 |          6        0.38        9.02
     2020q2 |         10        0.64        9.66
     2020q3 |         11        0.70       10.36
     2020q4 |         25        1.60       11.96
     2021q1 |         13        0.83       12.80
     2021q2 |         20        1.28       14.08
     2021q3 |         28        1.79       15.87
     2021q4 |         21        1.34       17.21
     2022q1 |         30        1.92       19.13
     2022q2 |         37        2.37       21.50
     2022q3 |         47        3.01       24.50
     2022q4 |         65        4.16       28.66
     2023q1 |         83        5.31       33.97
     2023q2 |         87        5.57       39.54
     2023q3 |        111        7.10       46.64
     2023q4 |        119        7.61       54.25
     2024q1 |        129        8.25       62.51
     2024q2 |        137        8.77       71.27
     2024q3 |        143        9.15       80.42
     2024q4 |        148        9.47       89.89
     2025q1 |        158       10.11      100.00
------------+-----------------------------------
      Total |      1,563      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          1        0.50        0.50
     2016q4 |          1        0.50        1.01
     2017q1 |          1        0.50        1.51
     2017q2 |          3        1.51        3.02
     2017q3 |          2        1.01        4.02
     2017q4 |          2        1.01        5.03
     2018q1 |          1        0.50        5.53
     2018q4 |          1        0.50        6.03
     2019q2 |          3        1.51        7.54
     2019q3 |          2        1.01        8.54
     2020q1 |          3        1.51       10.05
     2020q2 |          4        2.01       12.06
     2020q3 |          2        1.01       13.07
     2020q4 |          3        1.51       14.57
     2021q1 |          2        1.01       15.58
     2021q2 |          2        1.01       16.58
     2021q3 |          3        1.51       18.09
     2021q4 |          5        2.51       20.60
     2022q1 |          5        2.51       23.12
     2022q2 |          9        4.52       27.64
     2022q3 |          6        3.02       30.65
     2022q4 |          8        4.02       34.67
     2023q1 |          6        3.02       37.69
     2023q2 |          5        2.51       40.20
     2023q3 |         16        8.04       48.24
     2023q4 |         11        5.53       53.77
     2024q1 |         20       10.05       63.82
     2024q2 |         18        9.05       72.86
     2024q3 |         16        8.04       80.90
     2024q4 |         20       10.05       90.95
     2025q1 |         18        9.05      100.00
------------+-----------------------------------
      Total |        199      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          1        0.76        0.76
     2017q3 |          1        0.76        1.53
     2018q4 |          1        0.76        2.29
     2019q3 |          2        1.53        3.82
     2019q4 |          2        1.53        5.34
     2020q1 |          1        0.76        6.11
     2020q2 |          2        1.53        7.63
     2020q3 |          1        0.76        8.40
     2020q4 |          1        0.76        9.16
     2021q1 |          3        2.29       11.45
     2021q2 |          3        2.29       13.74
     2021q3 |          2        1.53       15.27
     2021q4 |          2        1.53       16.79
     2022q1 |          4        3.05       19.85
     2022q2 |          4        3.05       22.90
     2022q3 |          3        2.29       25.19
     2022q4 |          8        6.11       31.30
     2023q1 |          8        6.11       37.40
     2023q2 |         11        8.40       45.80
     2023q3 |          5        3.82       49.62
     2023q4 |          5        3.82       53.44
     2024q1 |         18       13.74       67.18
     2024q2 |          9        6.87       74.05
     2024q3 |         11        8.40       82.44
     2024q4 |          9        6.87       89.31
     2025q1 |         14       10.69      100.00
------------+-----------------------------------
      Total |        131      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          1        4.00        4.00
     2017q3 |          1        4.00        8.00
     2018q2 |          1        4.00       12.00
     2019q1 |          1        4.00       16.00
     2019q4 |          1        4.00       20.00
     2021q1 |          1        4.00       24.00
     2021q2 |          1        4.00       28.00
     2021q3 |          1        4.00       32.00
     2023q1 |          3       12.00       44.00
     2023q3 |          4       16.00       60.00
     2024q1 |          1        4.00       64.00
     2024q2 |          1        4.00       68.00
     2024q3 |          3       12.00       80.00
     2024q4 |          2        8.00       88.00
     2025q1 |          3       12.00      100.00
------------+-----------------------------------
      Total |         25      100.00


. 
. **Separate into 12-month time windows (for diagnosis date)
. gen diagnosis_year = (floor((diagnosis_date - date("$start_date", "DMY")) / 3
> 65.25) + 1) if inrange(diagnosis_date, date("$start_date", "DMY"), date("$end
> _date", "DMY"))

. lab var diagnosis_year "Year of diagnosis"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define diagnosis_year_lbl `i' "Apr `start'Mar `end'", add
  5. }

. lab val diagnosis_year diagnosis_year_lbl

. tab diagnosis_year, missing

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |         29        1.51        1.51
Apr 2017Mar 2018 |         47        2.45        3.96
Apr 2018Mar 2019 |         41        2.14        6.10
Apr 2019Mar 2020 |         57        2.97        9.07
Apr 2020Mar 2021 |         79        4.12       13.19
Apr 2021Mar 2022 |        126        6.57       19.76
Apr 2022Mar 2023 |        287       14.96       34.72
Apr 2023Mar 2024 |        542       28.26       62.98
Apr 2024Mar 2025 |        710       37.02      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |         24        1.54        1.54
Apr 2017Mar 2018 |         37        2.37        3.90
Apr 2018Mar 2019 |         37        2.37        6.27
Apr 2019Mar 2020 |         43        2.75        9.02
Apr 2020Mar 2021 |         60        3.84       12.86
Apr 2021Mar 2022 |         98        6.27       19.13
Apr 2022Mar 2023 |        232       14.84       33.97
Apr 2023Mar 2024 |        446       28.53       62.51
Apr 2024Mar 2025 |        586       37.49      100.00
------------------+-----------------------------------
            Total |      1,563      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          3        1.51        1.51
Apr 2017Mar 2018 |          8        4.02        5.53
Apr 2018Mar 2019 |          1        0.50        6.03
Apr 2019Mar 2020 |          8        4.02       10.05
Apr 2020Mar 2021 |         11        5.53       15.58
Apr 2021Mar 2022 |         15        7.54       23.12
Apr 2022Mar 2023 |         29       14.57       37.69
Apr 2023Mar 2024 |         52       26.13       63.82
Apr 2024Mar 2025 |         72       36.18      100.00
------------------+-----------------------------------
            Total |        199      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          1        0.76        0.76
Apr 2017Mar 2018 |          1        0.76        1.53
Apr 2018Mar 2019 |          1        0.76        2.29
Apr 2019Mar 2020 |          5        3.82        6.11
Apr 2020Mar 2021 |          7        5.34       11.45
Apr 2021Mar 2022 |         11        8.40       19.85
Apr 2022Mar 2023 |         23       17.56       37.40
Apr 2023Mar 2024 |         39       29.77       67.18
Apr 2024Mar 2025 |         43       32.82      100.00
------------------+-----------------------------------
            Total |        131      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          1        4.00        4.00
Apr 2017Mar 2018 |          1        4.00        8.00
Apr 2018Mar 2019 |          2        8.00       16.00
Apr 2019Mar 2020 |          1        4.00       20.00
Apr 2020Mar 2021 |          1        4.00       24.00
Apr 2021Mar 2022 |          2        8.00       32.00
Apr 2022Mar 2023 |          3       12.00       44.00
Apr 2023Mar 2024 |          5       20.00       64.00
Apr 2024Mar 2025 |          9       36.00      100.00
------------------+-----------------------------------
            Total |         25      100.00


. 
. **Separate into 3-month time windows (for appt date)
. gen appt_3m = qofd(rheum_appt_date)
(1,662 missing values generated)

. format appt_3m %tq

. lab var appt_3m "Time period for appointment"

. tab appt_3m, missing

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q2 |          1        0.05        0.05
     2015q3 |          2        0.10        0.16
     2015q4 |          1        0.05        0.21
     2016q1 |          2        0.10        0.31
     2016q2 |          1        0.05        0.36
     2016q3 |          2        0.10        0.47
     2016q4 |          3        0.16        0.63
     2017q2 |          1        0.05        0.68
     2017q3 |          2        0.10        0.78
     2017q4 |          2        0.10        0.89
     2018q3 |          3        0.16        1.04
     2018q4 |          3        0.16        1.20
     2019q3 |          2        0.10        1.30
     2019q4 |          2        0.10        1.41
     2020q2 |          1        0.05        1.46
     2020q3 |          1        0.05        1.51
     2020q4 |          1        0.05        1.56
     2021q1 |          1        0.05        1.62
     2021q2 |          3        0.16        1.77
     2021q3 |          2        0.10        1.88
     2021q4 |          1        0.05        1.93
     2022q1 |          4        0.21        2.14
     2022q2 |          5        0.26        2.40
     2022q3 |          8        0.42        2.82
     2022q4 |         11        0.57        3.39
     2023q1 |         19        0.99        4.38
     2023q2 |          9        0.47        4.85
     2023q3 |         19        0.99        5.84
     2023q4 |         28        1.46        7.30
     2024q1 |         42        2.19        9.49
     2024q2 |         35        1.82       11.31
     2024q3 |         17        0.89       12.20
     2024q4 |         15        0.78       12.98
     2025q1 |          7        0.36       13.35
          . |      1,662       86.65      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. bys eia_diagnosis: tab appt_3m, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.06        0.06
     2015q4 |          1        0.06        0.13
     2016q1 |          2        0.13        0.26
     2016q2 |          1        0.06        0.32
     2016q3 |          2        0.13        0.45
     2016q4 |          2        0.13        0.58
     2017q2 |          1        0.06        0.64
     2017q3 |          2        0.13        0.77
     2017q4 |          2        0.13        0.90
     2018q3 |          3        0.19        1.09
     2018q4 |          3        0.19        1.28
     2019q3 |          1        0.06        1.34
     2019q4 |          2        0.13        1.47
     2020q2 |          1        0.06        1.54
     2020q3 |          1        0.06        1.60
     2020q4 |          1        0.06        1.66
     2021q1 |          1        0.06        1.73
     2021q2 |          3        0.19        1.92
     2021q3 |          2        0.13        2.05
     2021q4 |          1        0.06        2.11
     2022q1 |          4        0.26        2.37
     2022q2 |          5        0.32        2.69
     2022q3 |          8        0.51        3.20
     2022q4 |         11        0.70        3.90
     2023q1 |         17        1.09        4.99
     2023q2 |          5        0.32        5.31
     2023q3 |         12        0.77        6.08
     2023q4 |         19        1.22        7.29
     2024q1 |         33        2.11        9.40
     2024q2 |         28        1.79       11.20
     2024q3 |         15        0.96       12.16
     2024q4 |         13        0.83       12.99
     2025q1 |          7        0.45       13.44
          . |      1,353       86.56      100.00
------------+-----------------------------------
      Total |      1,563      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.50        0.50
     2023q1 |          1        0.50        1.01
     2023q2 |          1        0.50        1.51
     2023q3 |          4        2.01        3.52
     2023q4 |          3        1.51        5.03
     2024q1 |          2        1.01        6.03
     2024q2 |          6        3.02        9.05
     2024q4 |          1        0.50        9.55
          . |        180       90.45      100.00
------------+-----------------------------------
      Total |        199      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2019q3 |          1        0.76        0.76
     2023q2 |          3        2.29        3.05
     2023q3 |          3        2.29        5.34
     2023q4 |          6        4.58        9.92
     2024q1 |          7        5.34       15.27
     2024q2 |          1        0.76       16.03
     2024q3 |          1        0.76       16.79
     2024q4 |          1        0.76       17.56
          . |        108       82.44      100.00
------------+-----------------------------------
      Total |        131      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q2 |          1        4.00        4.00
     2016q4 |          1        4.00        8.00
     2023q1 |          1        4.00       12.00
     2024q3 |          1        4.00       16.00
          . |         21       84.00      100.00
------------+-----------------------------------
      Total |         25      100.00


. 
. **Separate into 12-month time windows (for appt date)
. gen appt_year = (floor((rheum_appt_date - date("$start_date", "DMY")) / 365.2
> 5) + 1) if inrange(rheum_appt_date, date("$start_date", "DMY"), date("$end_da
> te", "DMY"))
(1,668 missing values generated)

. lab var appt_year "Year of appointment"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define appt_year_lbl `i' "Apr `start'Mar `end'", add
  5. }

. lab val appt_year appt_year_lbl

. tab appt_year, missing

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          6        0.31        0.31
Apr 2017Mar 2018 |          5        0.26        0.57
Apr 2018Mar 2019 |          6        0.31        0.89
Apr 2019Mar 2020 |          4        0.21        1.09
Apr 2020Mar 2021 |          4        0.21        1.30
Apr 2021Mar 2022 |         10        0.52        1.82
Apr 2022Mar 2023 |         44        2.29        4.12
Apr 2023Mar 2024 |         97        5.06        9.18
Apr 2024Mar 2025 |         74        3.86       13.03
                . |      1,668       86.97      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. bys eia_diagnosis: tab appt_year, missing

-------------------------------------------------------------------------------
-> eia_diagnosis = RA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          5        0.32        0.32
Apr 2017Mar 2018 |          5        0.32        0.64
Apr 2018Mar 2019 |          6        0.38        1.02
Apr 2019Mar 2020 |          3        0.19        1.22
Apr 2020Mar 2021 |          4        0.26        1.47
Apr 2021Mar 2022 |         10        0.64        2.11
Apr 2022Mar 2023 |         41        2.62        4.73
Apr 2023Mar 2024 |         69        4.41        9.15
Apr 2024Mar 2025 |         63        4.03       13.18
                . |      1,357       86.82      100.00
------------------+-----------------------------------
            Total |      1,563      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = PsA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2022Mar 2023 |          1        0.50        0.50
Apr 2023Mar 2024 |         10        5.03        5.53
Apr 2024Mar 2025 |          7        3.52        9.05
                . |        181       90.95      100.00
------------------+-----------------------------------
            Total |        199      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2019Mar 2020 |          1        0.76        0.76
Apr 2022Mar 2023 |          1        0.76        1.53
Apr 2023Mar 2024 |         18       13.74       15.27
Apr 2024Mar 2025 |          3        2.29       17.56
                . |        108       82.44      100.00
------------------+-----------------------------------
            Total |        131      100.00

-------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016Mar 2017 |          1        4.00        4.00
Apr 2022Mar 2023 |          1        4.00        8.00
Apr 2024Mar 2025 |          1        4.00       12.00
                . |         22       88.00      100.00
------------------+-----------------------------------
            Total |         25      100.00


. 
. *Define Rheumatology appointments ======================================*/
. 
. **Rheumatology appt definitions 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient dat
> e (with first attendance option selected) in the 12 months before and 60 days
>  after EIA code appeared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,662       86.65       86.65
        Yes |        256       13.35      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab mo_year_diagn rheum_appt, missing //proportion of patients with an rheum 
> outpatient date (with first attendance option selected) in the 12 months befo
> re and 60 days after EIA code appeared in GP record; data only April 2019 onw
> ards

Month/Year |     Rheumatology
        of |      appointment
 Diagnosis |        No        Yes |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         1          1 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         3          0 |         3 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         6          0 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         3          0 |         3 
  Apr-2017 |         7          1 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         4          0 |         4 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         3          1 |         4 
  Oct-2017 |         3          0 |         3 
  Nov-2017 |         2          1 |         3 
  Dec-2017 |         3          0 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         3          0 |         3 
  Apr-2018 |         3          0 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         5          0 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         3          2 |         5 
  Oct-2018 |         4          0 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         8          0 |         8 
  Jun-2019 |         5          1 |         6 
  Jul-2019 |         4          0 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         6          1 |         7 
  Oct-2019 |         6          0 |         6 
  Nov-2019 |         4          0 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         5          0 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         6          0 |         6 
  Jun-2020 |         5          0 |         5 
  Jul-2020 |         5          1 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         6          0 |         6 
  Oct-2020 |         8          1 |         9 
  Nov-2020 |         8          1 |         9 
  Dec-2020 |        10          1 |        11 
  Jan-2021 |         7          0 |         7 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |        10          0 |        10 
  May-2021 |        11          0 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        13          1 |        14 
  Aug-2021 |         9          2 |        11 
  Sep-2021 |         8          1 |         9 
  Oct-2021 |        13          0 |        13 
  Nov-2021 |         9          0 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        14          0 |        14 
  Mar-2022 |        16          1 |        17 
  Apr-2022 |        14          2 |        16 
  May-2022 |        20          1 |        21 
  Jun-2022 |        13          0 |        13 
  Jul-2022 |        19          1 |        20 
  Aug-2022 |        15          1 |        16 
  Sep-2022 |        18          2 |        20 
  Oct-2022 |        26          3 |        29 
  Nov-2022 |        28          1 |        29 
  Dec-2022 |        21          2 |        23 
  Jan-2023 |        24          1 |        25 
  Feb-2023 |        34          5 |        39 
  Mar-2023 |        33          3 |        36 
  Apr-2023 |        28          1 |        29 
  May-2023 |        32          4 |        36 
  Jun-2023 |        33          5 |        38 
  Jul-2023 |        42          3 |        45 
  Aug-2023 |        41          7 |        48 
  Sep-2023 |        39          4 |        43 
  Oct-2023 |        38          8 |        46 
  Nov-2023 |        39          3 |        42 
  Dec-2023 |        43          4 |        47 
  Jan-2024 |        58          8 |        66 
  Feb-2024 |        39         11 |        50 
  Mar-2024 |        45          7 |        52 
  Apr-2024 |        49         10 |        59 
  May-2024 |        53          7 |        60 
  Jun-2024 |        39          7 |        46 
  Jul-2024 |        55          9 |        64 
  Aug-2024 |        45         12 |        57 
  Sep-2024 |        41         11 |        52 
  Oct-2024 |        58          6 |        64 
  Nov-2024 |        46          8 |        54 
  Dec-2024 |        46         15 |        61 
  Jan-2025 |        50         18 |        68 
  Feb-2025 |        42         16 |        58 
  Mar-2025 |        51         16 |        67 
-----------+----------------------+----------
     Total |     1,662        256 |     1,918 

. tab rheum_appt_any, missing //proportion of patients with a rheum outpatient 
> date (without first attendance option selected) in the 12 months before and 6
> 0 days after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,399       72.94       72.94
          1 |        519       27.06      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab rheum_appt2, missing //proportion of patients with a rheum outpatient dat
> e (without first attendance option selected) in the 6 months before and 60 da
> ys after  EIA code appeared in GP record; data only April 2019 onwards

rheum_appt2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,511       78.78       78.78
          1 |        407       21.22      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab rheum_appt3, missing //proportion of patients with a rheum outpatient dat
> e (without first attendance option selected) in the 2 years before and 60 day
> s after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,193       62.20       62.20
          1 |        725       37.80      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab rheum_appt4, missing //proportion of patients with a rheum outpatient dat
> e (without first attendance option selected) in the 2 years before and 1 year
>  after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,193       62.20       62.20
          1 |        725       37.80      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. ***Check number of rheumatology appts in the year before EIA code
. tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |      1918  .4671533  1.000112         0         0         1
--------------------------------------------------------------------------

. bys diagnosis_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2016Mar 2017

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        29  .7586207  1.272095         0         0         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2017Mar 2018

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        47  .5744681  1.078338         0         0         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2018Mar 2019

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        41  .3658537  .7986269         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2019Mar 2020

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        57  .1929825    .66651         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2020Mar 2021

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        79   .164557  .5171515         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2021Mar 2022

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       126  .1746032  .5668067         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2022Mar 2023

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       287  .1498258  .4446948         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2023Mar 2024

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       542  .3450185  .6965475         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> diagnosis_year = Apr 2024Mar 2025

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       710  .7830986  1.330237         0         0         1
--------------------------------------------------------------------------

. bys appt_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

-------------------------------------------------------------------------------
-> appt_year = Apr 2016Mar 2017

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         6  2.333333  1.505545         2         1         4
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2017Mar 2018

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         5         2  1.224745         2         1         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2018Mar 2019

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         6       1.5  1.048809       1.5         1         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2019Mar 2020

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         4         2  1.825742         2        .5       3.5
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2020Mar 2021

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         4      1.25        .5         1         1       1.5
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2021Mar 2022

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        10       1.5  1.080123         1         1         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2022Mar 2023

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        44  1.522727  .9019007         1         1         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2023Mar 2024

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        97  2.041237  1.040007         2         1         3
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = Apr 2024Mar 2025

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        74  2.716216  1.786711         2         1         4
--------------------------------------------------------------------------

-------------------------------------------------------------------------------
-> appt_year = .

    variable |         N      mean        sd       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |      1668   .221223  .6365062         0         0         0
--------------------------------------------------------------------------

. 
. ***Check medium used for rheumatology appointment
. tab rheum_appt_medium, missing

rheum_appt_ |
     medium |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         32        1.67        1.67
          2 |         34        1.77        3.44
          3 |         29        1.51        4.95
          4 |         21        1.09        6.05
          5 |         30        1.56        7.61
          9 |         12        0.63        8.24
         10 |         30        1.56        9.80
         11 |         30        1.56       11.37
         98 |         38        1.98       13.35
          . |      1,662       86.65      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. gen rheum_appt_medium_clean = rheum_appt_medium if rheum_appt_medium >0 & rhe
> um_appt_medium<100
(1,662 missing values generated)

. recode rheum_appt_medium_clean 3=2 //recode telemedicine=telephone
(rheum_appt_medium_clean: 29 changes made)

. replace rheum_appt_medium_clean=10 if rheum_appt_medium_clean>2 & rheum_appt_
> medium_clean!=.
(131 real changes made)

. recode rheum_appt_medium_clean .=.u
(rheum_appt_medium_clean: 1662 changes made)

. lab define rheum_appt_medium_clean 1 "Face-to-face" 2 "Telephone" 10 "Other" 
> .u "Missing", modify

. lab val rheum_appt_medium_clean rheum_appt_medium_clean

. lab var rheum_appt_medium_clean "Rheumatology consultation medium"

. tab rheum_appt_medium_clean 

Rheumatology |
consultation |
      medium |      Freq.     Percent        Cum.
-------------+-----------------------------------
Face-to-face |         32       12.50       12.50
   Telephone |         63       24.61       37.11
       Other |        161       62.89      100.00
-------------+-----------------------------------
       Total |        256      100.00

. 
. *Gen rheum appt variable with 6m/12m+ until study end date
. gen rheum_appt_12m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-3
> 65) 
(1,736 missing values generated)

. recode rheum_appt_12m .=0
(rheum_appt_12m: 1736 changes made)

. lab var rheum_appt_12m "Rheumatology appt 12m+"

. lab define rheum_appt_12m 0 "No" 1 "Yes", modify

. lab val rheum_appt_12m rheum_appt_12m

. 
. gen rheum_appt_6m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-18
> 0) 
(1,683 missing values generated)

. recode rheum_appt_6m .=0
(rheum_appt_6m: 1683 changes made)

. lab var rheum_appt_6m "Rheumatology appt 6m+"

. lab define rheum_appt_6m 0 "No" 1 "Yes", modify

. lab val rheum_appt_6m rheum_appt_6m

. 
. **Define Rheumatology referrals ======================================*/
. 
. ***From HES OPA (referral_request_received_date)
. tab rheum_appt_ref, missing

rheum_appt_ |
        ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,662       86.65       86.65
          1 |        256       13.35      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. codebook rheum_appt_ref_date

-------------------------------------------------------------------------------
rheum_appt_ref_date                                                 (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [19095,23883]                units:  1
       or equivalently:  [12apr2012,22may2025]        units:  days
         unique values:  235                      missing .:  1,662/1,918

                  mean:   23248.6 = 26aug2023 (+ 14 hours)
              std. dev:   840.842

           percentiles:        10%       25%       50%       75%       90%
                             22095     23199     23553     23750     23841
                         29jun2020 08jul2023 26jun2024 09jan2025 10apr2025

. tab mo_year_diagn rheum_appt_ref, missing

Month/Year |
        of |    rheum_appt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         1          1 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         3          0 |         3 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         6          0 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         3          0 |         3 
  Apr-2017 |         7          1 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         4          0 |         4 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         3          1 |         4 
  Oct-2017 |         3          0 |         3 
  Nov-2017 |         2          1 |         3 
  Dec-2017 |         3          0 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         3          0 |         3 
  Apr-2018 |         3          0 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         5          0 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         3          2 |         5 
  Oct-2018 |         4          0 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         8          0 |         8 
  Jun-2019 |         5          1 |         6 
  Jul-2019 |         4          0 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         6          1 |         7 
  Oct-2019 |         6          0 |         6 
  Nov-2019 |         4          0 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         5          0 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         6          0 |         6 
  Jun-2020 |         5          0 |         5 
  Jul-2020 |         5          1 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         6          0 |         6 
  Oct-2020 |         8          1 |         9 
  Nov-2020 |         8          1 |         9 
  Dec-2020 |        10          1 |        11 
  Jan-2021 |         7          0 |         7 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |        10          0 |        10 
  May-2021 |        11          0 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        13          1 |        14 
  Aug-2021 |         9          2 |        11 
  Sep-2021 |         8          1 |         9 
  Oct-2021 |        13          0 |        13 
  Nov-2021 |         9          0 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        14          0 |        14 
  Mar-2022 |        16          1 |        17 
  Apr-2022 |        14          2 |        16 
  May-2022 |        20          1 |        21 
  Jun-2022 |        13          0 |        13 
  Jul-2022 |        19          1 |        20 
  Aug-2022 |        15          1 |        16 
  Sep-2022 |        18          2 |        20 
  Oct-2022 |        26          3 |        29 
  Nov-2022 |        28          1 |        29 
  Dec-2022 |        21          2 |        23 
  Jan-2023 |        24          1 |        25 
  Feb-2023 |        34          5 |        39 
  Mar-2023 |        33          3 |        36 
  Apr-2023 |        28          1 |        29 
  May-2023 |        32          4 |        36 
  Jun-2023 |        33          5 |        38 
  Jul-2023 |        42          3 |        45 
  Aug-2023 |        41          7 |        48 
  Sep-2023 |        39          4 |        43 
  Oct-2023 |        38          8 |        46 
  Nov-2023 |        39          3 |        42 
  Dec-2023 |        43          4 |        47 
  Jan-2024 |        58          8 |        66 
  Feb-2024 |        39         11 |        50 
  Mar-2024 |        45          7 |        52 
  Apr-2024 |        49         10 |        59 
  May-2024 |        53          7 |        60 
  Jun-2024 |        39          7 |        46 
  Jul-2024 |        55          9 |        64 
  Aug-2024 |        45         12 |        57 
  Sep-2024 |        41         11 |        52 
  Oct-2024 |        58          6 |        64 
  Nov-2024 |        46          8 |        54 
  Dec-2024 |        46         15 |        61 
  Jan-2025 |        50         18 |        68 
  Feb-2025 |        42         16 |        58 
  Mar-2025 |        51         16 |        67 
-----------+----------------------+----------
     Total |     1,662        256 |     1,918 

. tab mo_year_diagn rheum_appt_ref if rheum_appt!=., missing

Month/Year |
        of |    rheum_appt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         1          1 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         3          0 |         3 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         6          0 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         3          0 |         3 
  Apr-2017 |         7          1 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         4          0 |         4 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         3          1 |         4 
  Oct-2017 |         3          0 |         3 
  Nov-2017 |         2          1 |         3 
  Dec-2017 |         3          0 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         3          0 |         3 
  Apr-2018 |         3          0 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         5          0 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         3          2 |         5 
  Oct-2018 |         4          0 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         8          0 |         8 
  Jun-2019 |         5          1 |         6 
  Jul-2019 |         4          0 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         6          1 |         7 
  Oct-2019 |         6          0 |         6 
  Nov-2019 |         4          0 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         5          0 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         6          0 |         6 
  Jun-2020 |         5          0 |         5 
  Jul-2020 |         5          1 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         6          0 |         6 
  Oct-2020 |         8          1 |         9 
  Nov-2020 |         8          1 |         9 
  Dec-2020 |        10          1 |        11 
  Jan-2021 |         7          0 |         7 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |        10          0 |        10 
  May-2021 |        11          0 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        13          1 |        14 
  Aug-2021 |         9          2 |        11 
  Sep-2021 |         8          1 |         9 
  Oct-2021 |        13          0 |        13 
  Nov-2021 |         9          0 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        14          0 |        14 
  Mar-2022 |        16          1 |        17 
  Apr-2022 |        14          2 |        16 
  May-2022 |        20          1 |        21 
  Jun-2022 |        13          0 |        13 
  Jul-2022 |        19          1 |        20 
  Aug-2022 |        15          1 |        16 
  Sep-2022 |        18          2 |        20 
  Oct-2022 |        26          3 |        29 
  Nov-2022 |        28          1 |        29 
  Dec-2022 |        21          2 |        23 
  Jan-2023 |        24          1 |        25 
  Feb-2023 |        34          5 |        39 
  Mar-2023 |        33          3 |        36 
  Apr-2023 |        28          1 |        29 
  May-2023 |        32          4 |        36 
  Jun-2023 |        33          5 |        38 
  Jul-2023 |        42          3 |        45 
  Aug-2023 |        41          7 |        48 
  Sep-2023 |        39          4 |        43 
  Oct-2023 |        38          8 |        46 
  Nov-2023 |        39          3 |        42 
  Dec-2023 |        43          4 |        47 
  Jan-2024 |        58          8 |        66 
  Feb-2024 |        39         11 |        50 
  Mar-2024 |        45          7 |        52 
  Apr-2024 |        49         10 |        59 
  May-2024 |        53          7 |        60 
  Jun-2024 |        39          7 |        46 
  Jul-2024 |        55          9 |        64 
  Aug-2024 |        45         12 |        57 
  Sep-2024 |        41         11 |        52 
  Oct-2024 |        58          6 |        64 
  Nov-2024 |        46          8 |        54 
  Dec-2024 |        46         15 |        61 
  Jan-2025 |        50         18 |        68 
  Feb-2025 |        42         16 |        58 
  Mar-2025 |        51         16 |        67 
-----------+----------------------+----------
     Total |     1,662        256 |     1,918 

. 
. ***From RTT clock-stop data (only available for those with clock-stop date be
> tween May 2021 and May 2022)
. tab rtt_cl_ref, missing

 rtt_cl_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        930       48.49       48.49
          1 |        988       51.51      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. codebook rtt_cl_ref_date

-------------------------------------------------------------------------------
rtt_cl_ref_date                                                     (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [19939,23883]                units:  1
       or equivalently:  [04aug2014,22may2025]        units:  days
         unique values:  665                      missing .:  930/1,918

                  mean:   23239.7 = 17aug2023 (+ 18 hours)
              std. dev:   799.139

           percentiles:        10%       25%       50%       75%       90%
                             21995     23092     23561     23762     23840
                         21mar2020 23mar2023 04jul2024 21jan2025 09apr2025

. tab rtt_cl_ref if rheum_appt!=0 & rtt_cl_ref_date<=rheum_appt_date, missing 

 rtt_cl_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         55      100.00      100.00
------------+-----------------------------------
      Total |         55      100.00

. tab mo_year_diagn rtt_cl_ref, missing

Month/Year |
        of |      rtt_cl_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         2          0 |         2 
  May-2016 |         0          2 |         2 
  Jun-2016 |         3          2 |         5 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         1          1 |         2 
  Oct-2016 |         2          1 |         3 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         2          4 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         1          2 |         3 
  Apr-2017 |         5          3 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         0          4 |         4 
  Jul-2017 |         1          3 |         4 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         2          2 |         4 
  Oct-2017 |         1          2 |         3 
  Nov-2017 |         0          3 |         3 
  Dec-2017 |         0          3 |         3 
  Jan-2018 |         0          1 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         1          2 |         3 
  Apr-2018 |         1          2 |         3 
  May-2018 |         0          1 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         2          3 |         5 
  Aug-2018 |         1          2 |         3 
  Sep-2018 |         0          5 |         5 
  Oct-2018 |         2          2 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         1          2 |         3 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         2          3 |         5 
  May-2019 |         6          2 |         8 
  Jun-2019 |         3          3 |         6 
  Jul-2019 |         2          2 |         4 
  Aug-2019 |         2          2 |         4 
  Sep-2019 |         3          4 |         7 
  Oct-2019 |         4          2 |         6 
  Nov-2019 |         2          2 |         4 
  Dec-2019 |         2          2 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         2          1 |         3 
  Mar-2020 |         3          2 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         4          2 |         6 
  Jun-2020 |         3          2 |         5 
  Jul-2020 |         4          2 |         6 
  Aug-2020 |         1          1 |         2 
  Sep-2020 |         2          4 |         6 
  Oct-2020 |         6          3 |         9 
  Nov-2020 |         6          3 |         9 
  Dec-2020 |         9          2 |        11 
  Jan-2021 |         5          2 |         7 
  Feb-2021 |         4          4 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |         8          2 |        10 
  May-2021 |         8          3 |        11 
  Jun-2021 |         4          1 |         5 
  Jul-2021 |        10          4 |        14 
  Aug-2021 |         8          3 |        11 
  Sep-2021 |         7          2 |         9 
  Oct-2021 |         9          4 |        13 
  Nov-2021 |         8          1 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        11          3 |        14 
  Mar-2022 |        12          5 |        17 
  Apr-2022 |        12          4 |        16 
  May-2022 |        14          7 |        21 
  Jun-2022 |        11          2 |        13 
  Jul-2022 |        16          4 |        20 
  Aug-2022 |        12          4 |        16 
  Sep-2022 |        16          4 |        20 
  Oct-2022 |        23          6 |        29 
  Nov-2022 |        24          5 |        29 
  Dec-2022 |        15          8 |        23 
  Jan-2023 |        19          6 |        25 
  Feb-2023 |        28         11 |        39 
  Mar-2023 |        22         14 |        36 
  Apr-2023 |        21          8 |        29 
  May-2023 |        25         11 |        36 
  Jun-2023 |        25         13 |        38 
  Jul-2023 |        29         16 |        45 
  Aug-2023 |        30         18 |        48 
  Sep-2023 |        25         18 |        43 
  Oct-2023 |        20         26 |        46 
  Nov-2023 |        18         24 |        42 
  Dec-2023 |        27         20 |        47 
  Jan-2024 |        40         26 |        66 
  Feb-2024 |        22         28 |        50 
  Mar-2024 |        15         37 |        52 
  Apr-2024 |        26         33 |        59 
  May-2024 |        25         35 |        60 
  Jun-2024 |        16         30 |        46 
  Jul-2024 |        24         40 |        64 
  Aug-2024 |        13         44 |        57 
  Sep-2024 |        17         35 |        52 
  Oct-2024 |        10         54 |        64 
  Nov-2024 |         9         45 |        54 
  Dec-2024 |        13         48 |        61 
  Jan-2025 |        11         57 |        68 
  Feb-2025 |        11         47 |        58 
  Mar-2025 |        12         55 |        67 
-----------+----------------------+----------
     Total |       930        988 |     1,918 

. tab mo_year_diagn rtt_cl_ref if rheum_appt!=., missing

Month/Year |
        of |      rtt_cl_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         2          0 |         2 
  May-2016 |         0          2 |         2 
  Jun-2016 |         3          2 |         5 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         1          1 |         2 
  Oct-2016 |         2          1 |         3 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         2          4 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         1          2 |         3 
  Apr-2017 |         5          3 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         0          4 |         4 
  Jul-2017 |         1          3 |         4 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         2          2 |         4 
  Oct-2017 |         1          2 |         3 
  Nov-2017 |         0          3 |         3 
  Dec-2017 |         0          3 |         3 
  Jan-2018 |         0          1 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         1          2 |         3 
  Apr-2018 |         1          2 |         3 
  May-2018 |         0          1 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         2          3 |         5 
  Aug-2018 |         1          2 |         3 
  Sep-2018 |         0          5 |         5 
  Oct-2018 |         2          2 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         1          2 |         3 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         2          3 |         5 
  May-2019 |         6          2 |         8 
  Jun-2019 |         3          3 |         6 
  Jul-2019 |         2          2 |         4 
  Aug-2019 |         2          2 |         4 
  Sep-2019 |         3          4 |         7 
  Oct-2019 |         4          2 |         6 
  Nov-2019 |         2          2 |         4 
  Dec-2019 |         2          2 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         2          1 |         3 
  Mar-2020 |         3          2 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         4          2 |         6 
  Jun-2020 |         3          2 |         5 
  Jul-2020 |         4          2 |         6 
  Aug-2020 |         1          1 |         2 
  Sep-2020 |         2          4 |         6 
  Oct-2020 |         6          3 |         9 
  Nov-2020 |         6          3 |         9 
  Dec-2020 |         9          2 |        11 
  Jan-2021 |         5          2 |         7 
  Feb-2021 |         4          4 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |         8          2 |        10 
  May-2021 |         8          3 |        11 
  Jun-2021 |         4          1 |         5 
  Jul-2021 |        10          4 |        14 
  Aug-2021 |         8          3 |        11 
  Sep-2021 |         7          2 |         9 
  Oct-2021 |         9          4 |        13 
  Nov-2021 |         8          1 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        11          3 |        14 
  Mar-2022 |        12          5 |        17 
  Apr-2022 |        12          4 |        16 
  May-2022 |        14          7 |        21 
  Jun-2022 |        11          2 |        13 
  Jul-2022 |        16          4 |        20 
  Aug-2022 |        12          4 |        16 
  Sep-2022 |        16          4 |        20 
  Oct-2022 |        23          6 |        29 
  Nov-2022 |        24          5 |        29 
  Dec-2022 |        15          8 |        23 
  Jan-2023 |        19          6 |        25 
  Feb-2023 |        28         11 |        39 
  Mar-2023 |        22         14 |        36 
  Apr-2023 |        21          8 |        29 
  May-2023 |        25         11 |        36 
  Jun-2023 |        25         13 |        38 
  Jul-2023 |        29         16 |        45 
  Aug-2023 |        30         18 |        48 
  Sep-2023 |        25         18 |        43 
  Oct-2023 |        20         26 |        46 
  Nov-2023 |        18         24 |        42 
  Dec-2023 |        27         20 |        47 
  Jan-2024 |        40         26 |        66 
  Feb-2024 |        22         28 |        50 
  Mar-2024 |        15         37 |        52 
  Apr-2024 |        26         33 |        59 
  May-2024 |        25         35 |        60 
  Jun-2024 |        16         30 |        46 
  Jul-2024 |        24         40 |        64 
  Aug-2024 |        13         44 |        57 
  Sep-2024 |        17         35 |        52 
  Oct-2024 |        10         54 |        64 
  Nov-2024 |         9         45 |        54 
  Dec-2024 |        13         48 |        61 
  Jan-2025 |        11         57 |        68 
  Feb-2025 |        11         47 |        58 
  Mar-2025 |        12         55 |        67 
-----------+----------------------+----------
     Total |       930        988 |     1,918 

. tab rtt_cl_start, missing //check how this differs

rtt_cl_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        930       48.49       48.49
          1 |        988       51.51      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. codebook rtt_cl_start_date

-------------------------------------------------------------------------------
rtt_cl_start_date                                                   (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [20290,23858]                units:  1
       or equivalently:  [21jul2015,27apr2025]        units:  days
         unique values:  690                      missing .:  930/1,918

                  mean:   23072.9 = 03mar2023 (+ 20 hours)
              std. dev:   733.199

           percentiles:        10%       25%       50%       75%       90%
                             21910   23013.5     23333     23501     23641
                         27dec2019 03jan2023 19nov2023 05may2024 22sep2024

. tab rtt_cl_start if rheum_appt!=0 & rtt_cl_start_date<=rheum_appt_date, missi
> ng 

rtt_cl_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         84      100.00      100.00
------------+-----------------------------------
      Total |         84      100.00

. 
. ***From RTT open pathway data (only available as a snapshot of those with ope
> n RTT pathways as of May 2022)
. tab rtt_op_ref, missing

 rtt_op_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        921       48.02       48.02
          1 |        997       51.98      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. codebook rtt_op_ref_date

-------------------------------------------------------------------------------
rtt_op_ref_date                                                     (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [19181,23883]                units:  1
       or equivalently:  [07jul2012,22may2025]        units:  days
         unique values:  671                      missing .:  921/1,918

                  mean:   23283.4 = 30sep2023 (+ 9 hours)
              std. dev:   755.905

           percentiles:        10%       25%       50%       75%       90%
                             22246     23182     23557     23755     23843
                         27nov2020 21jun2023 30jun2024 14jan2025 12apr2025

. tab rtt_op_ref if rheum_appt!=0 & rtt_op_ref_date<=rheum_appt_date, missing 

 rtt_op_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         54      100.00      100.00
------------+-----------------------------------
      Total |         54      100.00

. tab mo_year_diagn rtt_op_ref, missing

Month/Year |
        of |      rtt_op_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         0          2 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         1          2 |         3 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         5          1 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         1          2 |         3 
  Apr-2017 |         2          6 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         2          2 |         4 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          3 |         4 
  Oct-2017 |         2          1 |         3 
  Nov-2017 |         1          2 |         3 
  Dec-2017 |         1          2 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         1          2 |         3 
  Apr-2018 |         2          1 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         3          1 |         4 
  Jul-2018 |         1          4 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         2          3 |         5 
  Oct-2018 |         2          2 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          2 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         6          2 |         8 
  Jun-2019 |         2          4 |         6 
  Jul-2019 |         3          1 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         4          3 |         7 
  Oct-2019 |         2          4 |         6 
  Nov-2019 |         2          2 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         1          1 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         3          2 |         5 
  Apr-2020 |         3          2 |         5 
  May-2020 |         5          1 |         6 
  Jun-2020 |         3          2 |         5 
  Jul-2020 |         4          2 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         5          1 |         6 
  Oct-2020 |         7          2 |         9 
  Nov-2020 |         6          3 |         9 
  Dec-2020 |         9          2 |        11 
  Jan-2021 |         6          1 |         7 
  Feb-2021 |         5          3 |         8 
  Mar-2021 |         3          1 |         4 
  Apr-2021 |         6          4 |        10 
  May-2021 |         5          6 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        11          3 |        14 
  Aug-2021 |         6          5 |        11 
  Sep-2021 |         7          2 |         9 
  Oct-2021 |        10          3 |        13 
  Nov-2021 |         7          2 |         9 
  Dec-2021 |         5          1 |         6 
  Jan-2022 |         5          3 |         8 
  Feb-2022 |        12          2 |        14 
  Mar-2022 |        14          3 |        17 
  Apr-2022 |        13          3 |        16 
  May-2022 |        18          3 |        21 
  Jun-2022 |        11          2 |        13 
  Jul-2022 |        16          4 |        20 
  Aug-2022 |        14          2 |        16 
  Sep-2022 |        17          3 |        20 
  Oct-2022 |        22          7 |        29 
  Nov-2022 |        23          6 |        29 
  Dec-2022 |        15          8 |        23 
  Jan-2023 |        18          7 |        25 
  Feb-2023 |        27         12 |        39 
  Mar-2023 |        22         14 |        36 
  Apr-2023 |        18         11 |        29 
  May-2023 |        22         14 |        36 
  Jun-2023 |        19         19 |        38 
  Jul-2023 |        27         18 |        45 
  Aug-2023 |        27         21 |        48 
  Sep-2023 |        26         17 |        43 
  Oct-2023 |        25         21 |        46 
  Nov-2023 |        17         25 |        42 
  Dec-2023 |        22         25 |        47 
  Jan-2024 |        28         38 |        66 
  Feb-2024 |        20         30 |        50 
  Mar-2024 |        24         28 |        52 
  Apr-2024 |        23         36 |        59 
  May-2024 |        13         47 |        60 
  Jun-2024 |        16         30 |        46 
  Jul-2024 |        16         48 |        64 
  Aug-2024 |        22         35 |        57 
  Sep-2024 |        18         34 |        52 
  Oct-2024 |        14         50 |        64 
  Nov-2024 |        11         43 |        54 
  Dec-2024 |        19         42 |        61 
  Jan-2025 |        10         58 |        68 
  Feb-2025 |        10         48 |        58 
  Mar-2025 |        11         56 |        67 
-----------+----------------------+----------
     Total |       921        997 |     1,918 

. tab mo_year_diagn rtt_op_ref if rheum_appt!=., missing

Month/Year |
        of |      rtt_op_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         0          2 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         1          2 |         3 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         5          1 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         1          2 |         3 
  Apr-2017 |         2          6 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         2          2 |         4 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          3 |         4 
  Oct-2017 |         2          1 |         3 
  Nov-2017 |         1          2 |         3 
  Dec-2017 |         1          2 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         1          2 |         3 
  Apr-2018 |         2          1 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         3          1 |         4 
  Jul-2018 |         1          4 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         2          3 |         5 
  Oct-2018 |         2          2 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          2 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         6          2 |         8 
  Jun-2019 |         2          4 |         6 
  Jul-2019 |         3          1 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         4          3 |         7 
  Oct-2019 |         2          4 |         6 
  Nov-2019 |         2          2 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         1          1 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         3          2 |         5 
  Apr-2020 |         3          2 |         5 
  May-2020 |         5          1 |         6 
  Jun-2020 |         3          2 |         5 
  Jul-2020 |         4          2 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         5          1 |         6 
  Oct-2020 |         7          2 |         9 
  Nov-2020 |         6          3 |         9 
  Dec-2020 |         9          2 |        11 
  Jan-2021 |         6          1 |         7 
  Feb-2021 |         5          3 |         8 
  Mar-2021 |         3          1 |         4 
  Apr-2021 |         6          4 |        10 
  May-2021 |         5          6 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        11          3 |        14 
  Aug-2021 |         6          5 |        11 
  Sep-2021 |         7          2 |         9 
  Oct-2021 |        10          3 |        13 
  Nov-2021 |         7          2 |         9 
  Dec-2021 |         5          1 |         6 
  Jan-2022 |         5          3 |         8 
  Feb-2022 |        12          2 |        14 
  Mar-2022 |        14          3 |        17 
  Apr-2022 |        13          3 |        16 
  May-2022 |        18          3 |        21 
  Jun-2022 |        11          2 |        13 
  Jul-2022 |        16          4 |        20 
  Aug-2022 |        14          2 |        16 
  Sep-2022 |        17          3 |        20 
  Oct-2022 |        22          7 |        29 
  Nov-2022 |        23          6 |        29 
  Dec-2022 |        15          8 |        23 
  Jan-2023 |        18          7 |        25 
  Feb-2023 |        27         12 |        39 
  Mar-2023 |        22         14 |        36 
  Apr-2023 |        18         11 |        29 
  May-2023 |        22         14 |        36 
  Jun-2023 |        19         19 |        38 
  Jul-2023 |        27         18 |        45 
  Aug-2023 |        27         21 |        48 
  Sep-2023 |        26         17 |        43 
  Oct-2023 |        25         21 |        46 
  Nov-2023 |        17         25 |        42 
  Dec-2023 |        22         25 |        47 
  Jan-2024 |        28         38 |        66 
  Feb-2024 |        20         30 |        50 
  Mar-2024 |        24         28 |        52 
  Apr-2024 |        23         36 |        59 
  May-2024 |        13         47 |        60 
  Jun-2024 |        16         30 |        46 
  Jul-2024 |        16         48 |        64 
  Aug-2024 |        22         35 |        57 
  Sep-2024 |        18         34 |        52 
  Oct-2024 |        14         50 |        64 
  Nov-2024 |        11         43 |        54 
  Dec-2024 |        19         42 |        61 
  Jan-2025 |        10         58 |        68 
  Feb-2025 |        10         48 |        58 
  Mar-2025 |        11         56 |        67 
-----------+----------------------+----------
     Total |       921        997 |     1,918 

. tab rtt_op_start, missing //check how this differs

rtt_op_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        921       48.02       48.02
          1 |        997       51.98      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. codebook rtt_op_start_date

-------------------------------------------------------------------------------
rtt_op_start_date                                                   (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric daily date (float)

                 range:  [20223,23866]                units:  1
       or equivalently:  [15may2015,05may2025]        units:  days
         unique values:  676                      missing .:  921/1,918

                  mean:   23106.4 = 06apr2023 (+ 11 hours)
              std. dev:   684.578

           percentiles:        10%       25%       50%       75%       90%
                             22203     23052     23318     23497     23629
                         15oct2020 11feb2023 04nov2023 01may2024 10sep2024

. tab rtt_op_start if rheum_appt!=0 & rtt_op_start_date<=rheum_appt_date, missi
> ng 

rtt_op_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         73      100.00      100.00
------------+-----------------------------------
      Total |         73      100.00

. 
. ***Combination of RTT clock-stop and open pathway
. gen rtt_ref_date = rtt_cl_ref_date
(930 missing values generated)

. replace rtt_ref_date = rtt_op_ref_date if rtt_cl_ref_date==. & rtt_op_ref_dat
> e!=. //need to think how to handle duplicate pathways
(369 real changes made)

. format %td rtt_ref_date

. gen rtt_ref =1 if rtt_ref_date!=.
(561 missing values generated)

. recode rtt_ref .=0
(rtt_ref: 561 changes made)

. tab rtt_ref, missing

    rtt_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        561       29.25       29.25
          1 |      1,357       70.75      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab mo_year_diagn rtt_ref, missing

Month/Year |
        of |        rtt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         0          2 |         2 
  Jun-2016 |         3          2 |         5 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         1          1 |         2 
  Oct-2016 |         1          2 |         3 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         2          4 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         1          2 |         3 
  Apr-2017 |         2          6 |         8 
  May-2017 |         3          3 |         6 
  Jun-2017 |         0          4 |         4 
  Jul-2017 |         0          4 |         4 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          3 |         4 
  Oct-2017 |         1          2 |         3 
  Nov-2017 |         0          3 |         3 
  Dec-2017 |         0          3 |         3 
  Jan-2018 |         0          1 |         1 
  Feb-2018 |         2          3 |         5 
  Mar-2018 |         1          2 |         3 
  Apr-2018 |         1          2 |         3 
  May-2018 |         0          1 |         1 
  Jun-2018 |         3          1 |         4 
  Jul-2018 |         0          5 |         5 
  Aug-2018 |         1          2 |         3 
  Sep-2018 |         0          5 |         5 
  Oct-2018 |         1          3 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         1          2 |         3 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         2          2 |         4 
  Apr-2019 |         2          3 |         5 
  May-2019 |         5          3 |         8 
  Jun-2019 |         1          5 |         6 
  Jul-2019 |         1          3 |         4 
  Aug-2019 |         2          2 |         4 
  Sep-2019 |         2          5 |         7 
  Oct-2019 |         1          5 |         6 
  Nov-2019 |         2          2 |         4 
  Dec-2019 |         2          2 |         4 
  Jan-2020 |         1          1 |         2 
  Feb-2020 |         2          1 |         3 
  Mar-2020 |         2          3 |         5 
  Apr-2020 |         3          2 |         5 
  May-2020 |         4          2 |         6 
  Jun-2020 |         3          2 |         5 
  Jul-2020 |         4          2 |         6 
  Aug-2020 |         1          1 |         2 
  Sep-2020 |         2          4 |         6 
  Oct-2020 |         5          4 |         9 
  Nov-2020 |         4          5 |         9 
  Dec-2020 |         7          4 |        11 
  Jan-2021 |         5          2 |         7 
  Feb-2021 |         4          4 |         8 
  Mar-2021 |         3          1 |         4 
  Apr-2021 |         6          4 |        10 
  May-2021 |         5          6 |        11 
  Jun-2021 |         4          1 |         5 
  Jul-2021 |         9          5 |        14 
  Aug-2021 |         6          5 |        11 
  Sep-2021 |         7          2 |         9 
  Oct-2021 |         9          4 |        13 
  Nov-2021 |         6          3 |         9 
  Dec-2021 |         5          1 |         6 
  Jan-2022 |         5          3 |         8 
  Feb-2022 |         9          5 |        14 
  Mar-2022 |        11          6 |        17 
  Apr-2022 |        10          6 |        16 
  May-2022 |        14          7 |        21 
  Jun-2022 |         9          4 |        13 
  Jul-2022 |        13          7 |        20 
  Aug-2022 |        11          5 |        16 
  Sep-2022 |        14          6 |        20 
  Oct-2022 |        18         11 |        29 
  Nov-2022 |        20          9 |        29 
  Dec-2022 |        10         13 |        23 
  Jan-2023 |        14         11 |        25 
  Feb-2023 |        21         18 |        39 
  Mar-2023 |        13         23 |        36 
  Apr-2023 |        16         13 |        29 
  May-2023 |        14         22 |        36 
  Jun-2023 |        12         26 |        38 
  Jul-2023 |        19         26 |        45 
  Aug-2023 |        17         31 |        48 
  Sep-2023 |        17         26 |        43 
  Oct-2023 |        10         36 |        46 
  Nov-2023 |         9         33 |        42 
  Dec-2023 |        16         31 |        47 
  Jan-2024 |        20         46 |        66 
  Feb-2024 |         8         42 |        50 
  Mar-2024 |         6         46 |        52 
  Apr-2024 |         8         51 |        59 
  May-2024 |         8         52 |        60 
  Jun-2024 |         5         41 |        46 
  Jul-2024 |         6         58 |        64 
  Aug-2024 |         6         51 |        57 
  Sep-2024 |         4         48 |        52 
  Oct-2024 |         2         62 |        64 
  Nov-2024 |         2         52 |        54 
  Dec-2024 |         4         57 |        61 
  Jan-2025 |         1         67 |        68 
  Feb-2025 |         1         57 |        58 
  Mar-2025 |         1         66 |        67 
-----------+----------------------+----------
     Total |       561      1,357 |     1,918 

. tab mo_year_diagn rtt_ref if rheum_appt!=0 & rtt_ref_date<=rheum_appt_date, m
> issing 

Month/Year |
        of |  rtt_ref
 Diagnosis |         1 |     Total
-----------+-----------+----------
  Apr-2017 |         1 |         1 
  May-2017 |         1 |         1 
  Jun-2017 |         1 |         1 
  Aug-2017 |         1 |         1 
  Sep-2017 |         1 |         1 
  Nov-2017 |         1 |         1 
  Feb-2018 |         1 |         1 
  Sep-2018 |         1 |         1 
  Nov-2018 |         1 |         1 
  Nov-2020 |         1 |         1 
  Aug-2021 |         1 |         1 
  May-2023 |         1 |         1 
  Jun-2023 |         1 |         1 
  Oct-2023 |         1 |         1 
  Nov-2023 |         1 |         1 
  Jan-2024 |         3 |         3 
  Feb-2024 |         2 |         2 
  Apr-2024 |         1 |         1 
  May-2024 |         3 |         3 
  Jul-2024 |         4 |         4 
  Aug-2024 |         2 |         2 
  Sep-2024 |         4 |         4 
  Oct-2024 |         5 |         5 
  Nov-2024 |         1 |         1 
  Dec-2024 |         5 |         5 
  Jan-2025 |         8 |         8 
  Feb-2025 |         8 |         8 
  Mar-2025 |         9 |         9 
-----------+-----------+----------
     Total |        70 |        70 

. 
. ***From clinical events (Nb. low capture of coded rheumatology referrals in c
> linical events at present)
. tab rheum_ref_gp_preappt, missing //last rheum referral in the 2 years before
>  rheumatology outpatient (requires rheum appt to have been present)

rheum_ref_g |
  p_preappt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,916       99.90       99.90
          1 |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab rheum_ref_gp_preappt if rheum_appt!=0 & rheum_ref_gp_preappt_date<=rheum_
> appt_date, missing  //last rheum referral in the 2 years before rheumatology 
> outpatient, assuming ref date before rheum appt date (should be accounted for
>  by Python code)

rheum_ref_g |
  p_preappt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2      100.00      100.00
------------+-----------------------------------
      Total |          2      100.00

. tab rheum_ref_gp_precode, missing //last rheum referral in the 2 years before
>  IA code 

rheum_ref_g |
  p_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,906       99.37       99.37
          1 |         12        0.63      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. gen referral_rheum_comb_date = rheum_ref_gp_preappt_date if rheum_ref_gp_prea
> ppt_date!=.
(1,916 missing values generated)

. replace referral_rheum_comb_date = rheum_ref_gp_precode_date if rheum_ref_gp_
> preappt_date==. & rheum_ref_gp_precode_date!=. //combination of the two above
(10 real changes made)

. format %td referral_rheum_comb_date

. 
. ***From GP appointments (proxy)
. tab last_gp_refrheum, missing //proportion with last GP appointment in 2 year
> s before rheum referral (pre-rheum appt); requires there to have been a rheum
>  referral before a rheum appt

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,918      100.00      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. gen last_gp_prerheum_12m=last_gp_prerheum if rheum_appt_date!=. & rheum_appt_
> date<=(date("$end_date", "DMY")-365)
(1,736 missing values generated)

. recode last_gp_prerheum_12m .=0
(last_gp_prerheum_12m: 1736 changes made)

. lab var last_gp_prerheum_12m "GP and rheum appt 12m+"

. lab define last_gp_prerheum_12m 0 "No" 1 "Yes", modify

. lab val last_gp_prerheum_12m last_gp_prerheum_12m

. 
. gen last_gp_prerheum_6m=last_gp_prerheum if rheum_appt_date!=. & rheum_appt_d
> ate<=(date("$end_date", "DMY")-180)
(1,683 missing values generated)

. recode last_gp_prerheum_6m .=0
(last_gp_prerheum_6m: 1683 changes made)

. lab var last_gp_prerheum_6m "GP and rheum appt 6m+"

. lab define last_gp_prerheum_6m 0 "No" 1 "Yes", modify

. lab val last_gp_prerheum_6m last_gp_prerheum_6m

. 
. tab last_gp_refcode, missing //last GP appointment before rheum ref (pre-EIA 
> code ref); requires there to have been a rheum referral before an EIA code (i
> .e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,916       99.90       99.90
          1 |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab last_gp_prerheum, missing //last GP appointment before rheum appt; requir
> es there to have been a rheum appt before and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,801       93.90       93.90
          1 |        117        6.10      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab last_gp_precode, missing //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,002       52.24       52.24
          1 |        916       47.76      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. ****All appts in the correct order (using clinical events referrals)
. gen all_appts=1 if last_gp_refrheum==1 & rheum_ref_gp_preappt==1 & rheum_appt
> ==1 & (last_gp_refrheum_date<=rheum_ref_gp_preappt_date) & (rheum_ref_gp_prea
> ppt_date<=rheum_appt_date)
(1,918 missing values generated)

. recode all_appts .=0
(all_appts: 1918 changes made)

. tab all_appts, missing //proportion who had a last gp appt, then rheum ref, t
> hen rheum appt

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,918      100.00      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **Define who qualifies in terms of appointments and referrals ===============
> ================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Proportion of patients with at least 6 or 12 months of GP registration afte
> r diagnostic code
. rename has_6m_follow_up has_6m_follow_up_s 

. gen has_6m_follow_up=1 if has_6m_follow_up_s=="T"
(1,684 missing values generated)

. recode has_6m_follow_up .=0
(has_6m_follow_up: 1684 changes made)

. drop has_6m_follow_up_s

. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,684       87.80       87.80
          1 |        234       12.20      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. rename has_12m_follow_up has_12m_follow_up_s 

. gen has_12m_follow_up=1 if has_12m_follow_up_s=="T"
(1,736 missing values generated)

. recode has_12m_follow_up .=0
(has_12m_follow_up: 1736 changes made)

. drop has_12m_follow_up_s

. tab has_12m_follow_up 

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,736       90.51       90.51
          1 |        182        9.49      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab mo_year_diagn has_6m_follow_up

Month/Year |
        of |   has_6m_follow_up
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         1          1 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         3          0 |         3 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         6          0 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         3          0 |         3 
  Apr-2017 |         7          1 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         4          0 |         4 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         3          1 |         4 
  Oct-2017 |         3          0 |         3 
  Nov-2017 |         2          1 |         3 
  Dec-2017 |         3          0 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         3          0 |         3 
  Apr-2018 |         3          0 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         5          0 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         3          2 |         5 
  Oct-2018 |         4          0 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         8          0 |         8 
  Jun-2019 |         5          1 |         6 
  Jul-2019 |         4          0 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         6          1 |         7 
  Oct-2019 |         6          0 |         6 
  Nov-2019 |         4          0 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         5          0 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         6          0 |         6 
  Jun-2020 |         5          0 |         5 
  Jul-2020 |         5          1 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         6          0 |         6 
  Oct-2020 |         8          1 |         9 
  Nov-2020 |         8          1 |         9 
  Dec-2020 |        10          1 |        11 
  Jan-2021 |         7          0 |         7 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |        10          0 |        10 
  May-2021 |        11          0 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        13          1 |        14 
  Aug-2021 |         9          2 |        11 
  Sep-2021 |         8          1 |         9 
  Oct-2021 |        13          0 |        13 
  Nov-2021 |         9          0 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        14          0 |        14 
  Mar-2022 |        16          1 |        17 
  Apr-2022 |        14          2 |        16 
  May-2022 |        20          1 |        21 
  Jun-2022 |        13          0 |        13 
  Jul-2022 |        19          1 |        20 
  Aug-2022 |        15          1 |        16 
  Sep-2022 |        18          2 |        20 
  Oct-2022 |        26          3 |        29 
  Nov-2022 |        28          1 |        29 
  Dec-2022 |        21          2 |        23 
  Jan-2023 |        24          1 |        25 
  Feb-2023 |        34          5 |        39 
  Mar-2023 |        33          3 |        36 
  Apr-2023 |        28          1 |        29 
  May-2023 |        32          4 |        36 
  Jun-2023 |        33          5 |        38 
  Jul-2023 |        42          3 |        45 
  Aug-2023 |        41          7 |        48 
  Sep-2023 |        39          4 |        43 
  Oct-2023 |        38          8 |        46 
  Nov-2023 |        39          3 |        42 
  Dec-2023 |        43          4 |        47 
  Jan-2024 |        58          8 |        66 
  Feb-2024 |        39         11 |        50 
  Mar-2024 |        45          7 |        52 
  Apr-2024 |        49         10 |        59 
  May-2024 |        53          7 |        60 
  Jun-2024 |        39          7 |        46 
  Jul-2024 |        55          9 |        64 
  Aug-2024 |        46         11 |        57 
  Sep-2024 |        43          9 |        52 
  Oct-2024 |        60          4 |        64 
  Nov-2024 |        48          6 |        54 
  Dec-2024 |        48         13 |        61 
  Jan-2025 |        55         13 |        68 
  Feb-2025 |        46         12 |        58 
  Mar-2025 |        55         12 |        67 
-----------+----------------------+----------
     Total |     1,684        234 |     1,918 

. tab mo_year_diagn has_12m_follow_up

Month/Year |
        of |   has_12m_follow_up
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          2 |         2 
  May-2016 |         1          1 |         2 
  Jun-2016 |         4          1 |         5 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         2          0 |         2 
  Oct-2016 |         3          0 |         3 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         6          0 |         6 
  Jan-2017 |         0          2 |         2 
  Mar-2017 |         3          0 |         3 
  Apr-2017 |         7          1 |         8 
  May-2017 |         4          2 |         6 
  Jun-2017 |         3          1 |         4 
  Jul-2017 |         4          0 |         4 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         3          1 |         4 
  Oct-2017 |         3          0 |         3 
  Nov-2017 |         2          1 |         3 
  Dec-2017 |         3          0 |         3 
  Jan-2018 |         1          0 |         1 
  Feb-2018 |         3          2 |         5 
  Mar-2018 |         3          0 |         3 
  Apr-2018 |         3          0 |         3 
  May-2018 |         1          0 |         1 
  Jun-2018 |         4          0 |         4 
  Jul-2018 |         5          0 |         5 
  Aug-2018 |         2          1 |         3 
  Sep-2018 |         3          2 |         5 
  Oct-2018 |         4          0 |         4 
  Nov-2018 |         3          1 |         4 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         3          0 |         3 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         4          0 |         4 
  Apr-2019 |         3          2 |         5 
  May-2019 |         8          0 |         8 
  Jun-2019 |         5          1 |         6 
  Jul-2019 |         4          0 |         4 
  Aug-2019 |         3          1 |         4 
  Sep-2019 |         6          1 |         7 
  Oct-2019 |         6          0 |         6 
  Nov-2019 |         4          0 |         4 
  Dec-2019 |         4          0 |         4 
  Jan-2020 |         2          0 |         2 
  Feb-2020 |         3          0 |         3 
  Mar-2020 |         5          0 |         5 
  Apr-2020 |         5          0 |         5 
  May-2020 |         6          0 |         6 
  Jun-2020 |         5          0 |         5 
  Jul-2020 |         5          1 |         6 
  Aug-2020 |         2          0 |         2 
  Sep-2020 |         6          0 |         6 
  Oct-2020 |         8          1 |         9 
  Nov-2020 |         8          1 |         9 
  Dec-2020 |        10          1 |        11 
  Jan-2021 |         7          0 |         7 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         4          0 |         4 
  Apr-2021 |        10          0 |        10 
  May-2021 |        11          0 |        11 
  Jun-2021 |         5          0 |         5 
  Jul-2021 |        13          1 |        14 
  Aug-2021 |         9          2 |        11 
  Sep-2021 |         8          1 |         9 
  Oct-2021 |        13          0 |        13 
  Nov-2021 |         9          0 |         9 
  Dec-2021 |         6          0 |         6 
  Jan-2022 |         8          0 |         8 
  Feb-2022 |        14          0 |        14 
  Mar-2022 |        16          1 |        17 
  Apr-2022 |        14          2 |        16 
  May-2022 |        20          1 |        21 
  Jun-2022 |        13          0 |        13 
  Jul-2022 |        19          1 |        20 
  Aug-2022 |        15          1 |        16 
  Sep-2022 |        18          2 |        20 
  Oct-2022 |        26          3 |        29 
  Nov-2022 |        28          1 |        29 
  Dec-2022 |        21          2 |        23 
  Jan-2023 |        24          1 |        25 
  Feb-2023 |        34          5 |        39 
  Mar-2023 |        33          3 |        36 
  Apr-2023 |        28          1 |        29 
  May-2023 |        32          4 |        36 
  Jun-2023 |        33          5 |        38 
  Jul-2023 |        42          3 |        45 
  Aug-2023 |        41          7 |        48 
  Sep-2023 |        39          4 |        43 
  Oct-2023 |        38          8 |        46 
  Nov-2023 |        39          3 |        42 
  Dec-2023 |        43          4 |        47 
  Jan-2024 |        58          8 |        66 
  Feb-2024 |        39         11 |        50 
  Mar-2024 |        46          6 |        52 
  Apr-2024 |        52          7 |        59 
  May-2024 |        54          6 |        60 
  Jun-2024 |        39          7 |        46 
  Jul-2024 |        59          5 |        64 
  Aug-2024 |        47         10 |        57 
  Sep-2024 |        47          5 |        52 
  Oct-2024 |        62          2 |        64 
  Nov-2024 |        51          3 |        54 
  Dec-2024 |        56          5 |        61 
  Jan-2025 |        61          7 |        68 
  Feb-2025 |        56          2 |        58 
  Mar-2025 |        64          3 |        67 
-----------+----------------------+----------
     Total |     1,736        182 |     1,918 

. 
. *For appt and csDMARD analyses, all patients must have 1) rheum appt 2) GP ap
> pt before rheum appt 3) 12m follow-up after rheum appt 4) 12m of registration
>  after diagnostic code
. gen has_6m_post_appt=1 if rheum_appt_date!=. & rheum_appt_date<=(date("$end_d
> ate", "DMY")-180) & has_6m_follow_up==1 & last_gp_prerheum==1
(1,816 missing values generated)

. recode has_6m_post_appt .=0
(has_6m_post_appt: 1816 changes made)

. lab var has_6m_post_appt "GP/rheum/registration 6m+"

. lab define has_6m_post_appt 0 "No" 1 "Yes", modify

. lab val has_6m_post_appt has_6m_post_appt

. tab has_6m_post_appt

GP/rheum/re |
 gistration |
        6m+ |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,816       94.68       94.68
        Yes |        102        5.32      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. gen has_12m_post_appt=1 if rheum_appt_date!=. & rheum_appt_date<=(date("$end_
> date", "DMY")-365) & has_12m_follow_up==1 & last_gp_prerheum==1
(1,847 missing values generated)

. recode has_12m_post_appt .=0
(has_12m_post_appt: 1847 changes made)

. lab var has_12m_post_appt "GP/rheum/registration 12m+"

. lab define has_12m_post_appt 0 "No" 1 "Yes", modify

. lab val has_12m_post_appt has_12m_post_appt

. tab has_12m_post_appt

GP/rheum/re |
 gistration |
       12m+ |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,847       96.30       96.30
        Yes |         71        3.70      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. *Time to rheum referral =============================================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Time from last GP appt to rheum ref before rheum appt (i.e. if appts are pr
> esent and in correct time order)
. gen time_gp_rheum_ref_appt = (rheum_ref_gp_preappt_date - last_gp_refrheum_da
> te) if rheum_ref_gp_preappt_date!=. & last_gp_refrheum_date!=. & rheum_appt_d
> ate!=. & (rheum_ref_gp_preappt_date>=last_gp_refrheum_date) & (rheum_ref_gp_p
> reappt_date<=rheum_appt_date)
(1,918 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (sh
> ould be same number as all_appts)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |         0         .         .         .         .
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(1,918 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt<=7 
> & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(0 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. 
> & gp_ref_cat==.
(0 real changes made)

. lab define gp_ref_cat 1 "Within 3 days" 2 "Between 3-7 days" 3 "More than 7 d
> ays", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               . |      1,918      100.00      100.00
-----------------+-----------------------------------
           Total |      1,918      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(1,918 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(0 real changes made)

. lab define gp_ref_3d 1 "Within 3 days" 2 "More than 3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               . |      1,918      100.00      100.00
-----------------+-----------------------------------
           Total |      1,918      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; inclu
> des those with no rheum appt)
. gen time_gp_rheum_ref_code = (rheum_ref_gp_precode_date - last_gp_refcode_dat
> e) if rheum_ref_gp_precode_date!=. & last_gp_refcode_date!=. & rheum_ref_gp_p
> recode_date>=last_gp_refcode_date & rheum_ref_gp_precode_date<=eia_code_date
(1,916 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |         2       225       225       206       244
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes t
> hose with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(1,918 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_
> appt==. & time_gp_rheum_ref_code!=.
(2 real changes made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |         2       225       225       206       244
----------------------------------------------------------------

. 
. *Time to rheum appointment=============================================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Time from last GP pre-rheum appt to first rheum appt (proxy for referral to
>  appt delay)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_a
> ppt_date!=. & last_gp_prerheum_date!=. & (rheum_appt_date>=last_gp_prerheum_d
> ate)
(1,801 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |       117  196.4701       111        52       298
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct
>  order)
. gen time_ref_rheum_appt = (rheum_appt_date - rheum_ref_gp_preappt_date) if rh
> eum_appt_date!=. & rheum_ref_gp_preappt_date!=. & (rheum_ref_gp_preappt_date<
> =rheum_appt_date)
(1,916 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |         2        89        89        45       133
----------------------------------------------------------------

. 
. **Time from rheum appt received date to rheum appt (i.e. if appts are present
>  and in correct order)
. gen time_hes_rheum_appt = (rheum_appt_date - rheum_appt_ref_date) if rheum_ap
> pt_date!=. & rheum_appt_ref_date!=. & (rheum_appt_ref_date<=rheum_appt_date)
(1,843 missing values generated)

. tabstat time_hes_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_hes_r~t |        75  323.3467       196        91       442
----------------------------------------------------------------

. 
. **Time from RTT combined ref date to rheum appt (i.e. if appts are present an
> d in correct order)
. gen time_rtt_rheum_appt = (rheum_appt_date - rtt_ref_date) if rheum_appt_date
> !=. & rtt_ref_date!=. & (rtt_ref_date<=rheum_appt_date)
(1,848 missing values generated)

. tabstat time_rtt_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_r~t |        70  326.8857       198        75       426
----------------------------------------------------------------

. 
. **Time from RTT closed ref date to rheum appt (i.e. if appts are present and 
> in correct order)
. gen time_rtt_cl_rheum_appt = (rheum_appt_date - rtt_cl_ref_date) if rheum_app
> t_date!=. & rtt_cl_ref_date!=. & (rtt_cl_ref_date<=rheum_appt_date)
(1,863 missing values generated)

. tabstat time_rtt_cl_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_c~t |        55  330.8909       238        76       463
----------------------------------------------------------------

. 
. **Time from RTT open ref date to rheum appt (i.e. if appts are present and in
>  correct order)
. gen time_rtt_op_rheum_appt = (rheum_appt_date - rtt_op_ref_date) if rheum_app
> t_date!=. & rtt_op_ref_date!=. & (rtt_op_ref_date<=rheum_appt_date)
(1,864 missing values generated)

. tabstat time_rtt_op_rheum_appt, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_o~t |        54  361.2963     236.5        89       488
----------------------------------------------------------------

. 
. gen gp_appt_cat=1 if time_gp_rheum_appt<=21 & time_gp_rheum_appt!=. 
(1,903 missing values generated)

. replace gp_appt_cat=2 if time_gp_rheum_appt>21 & time_gp_rheum_appt<=42 & tim
> e_gp_rheum_appt!=. & gp_appt_cat==.
(10 real changes made)

. replace gp_appt_cat=3 if time_gp_rheum_appt>42 & time_gp_rheum_appt!=. & gp_a
> ppt_cat==.
(92 real changes made)

. lab define gp_appt_cat 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than 
> 6 weeks", modify

. lab val gp_appt_cat gp_appt_cat

. lab var gp_appt_cat "Time to rheumatology assessment, overall"

. tab gp_appt_cat, missing

          Time to |
     rheumatology |
      assessment, |
          overall |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |         15        0.78        0.78
Between 3-6 weeks |         10        0.52        1.30
More than 6 weeks |         92        4.80        6.10
                . |      1,801       93.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.         gen gp_appt_cat_`start'=gp_appt_cat if appt_year==`i'
  5.     lab define gp_appt_cat_`start' 1 "Within 3 weeks" 2 "Between 3-6 weeks
> " 3 "More than 6 weeks", modify
  6.         lab val gp_appt_cat_`start' gp_appt_cat_`start'
  7.         lab var gp_appt_cat_`start' "Time to rheumatology assessment, Apr 
> `start'-Mar `end'"
  8.         tab gp_appt_cat_`start', missing
  9. }
(1,914 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2016-Mar 2017 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          1        0.05        0.05
More than 6 weeks |          3        0.16        0.21
                . |      1,914       99.79      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,914 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2017-Mar 2018 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          1        0.05        0.05
More than 6 weeks |          3        0.16        0.21
                . |      1,914       99.79      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,913 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2018-Mar 2019 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          1        0.05        0.05
More than 6 weeks |          4        0.21        0.26
                . |      1,913       99.74      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,917 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2019-Mar 2020 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          1        0.05        0.05
                . |      1,917       99.95      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,917 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2020-Mar 2021 |      Freq.     Percent        Cum.
------------------+-----------------------------------
Between 3-6 weeks |          1        0.05        0.05
                . |      1,917       99.95      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,916 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2021-Mar 2022 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          2        0.10        0.10
                . |      1,916       99.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,910 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2022-Mar 2023 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          8        0.42        0.42
                . |      1,910       99.58      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,874 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2023-Mar 2024 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          7        0.36        0.36
Between 3-6 weeks |          1        0.05        0.42
More than 6 weeks |         36        1.88        2.29
                . |      1,874       97.71      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,872 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2024-Mar 2025 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          5        0.26        0.26
Between 3-6 weeks |          8        0.42        0.68
More than 6 weeks |         33        1.72        2.40
                . |      1,872       97.60      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. gen gp_appt_3w=1 if time_gp_rheum_appt<=21 & time_gp_rheum_appt!=. 
(1,903 missing values generated)

. replace gp_appt_3w=2 if time_gp_rheum_appt>21 & time_gp_rheum_appt!=.
(102 real changes made)

. lab define gp_appt_3w 1 "Within 3 weeks" 2 "More than 3 weeks", modify

. lab val gp_appt_3w gp_appt_3w

. lab var gp_appt_3w "Time to rheumatology assessment, overall"

. tab gp_appt_3w, missing

          Time to |
     rheumatology |
      assessment, |
          overall |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |         15        0.78        0.78
More than 3 weeks |        102        5.32        6.10
                . |      1,801       93.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(1,918 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt<=42 & 
> time_ref_rheum_appt!=. & ref_appt_cat==.
(0 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & r
> ef_appt_cat==.
(2 real changes made)

. lab define ref_appt_cat 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than
>  6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

          Time to |
     rheumatology |
       assessment |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          2        0.10        0.10
                . |      1,916       99.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.         gen ref_appt_cat_`start'=ref_appt_cat if appt_year==`i'
  5.     lab define ref_appt_cat_`start' 1 "Within 3 weeks" 2 "Between 3-6 week
> s" 3 "More than 6 weeks", modify
  6.         lab val ref_appt_cat_`start' ref_appt_cat_`start'
  7.         lab var ref_appt_cat_`start' "Time to rheumatology assessment, Apr
>  `start'-Mar `end'"
  8.         tab ref_appt_cat_`start', missing
  9. }
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2016-Mar 2017 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2017-Mar 2018 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2018-Mar 2019 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2019-Mar 2020 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2020-Mar 2021 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2021-Mar 2022 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2022-Mar 2023 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,918 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2023-Mar 2024 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,918      100.00      100.00
------------------+-----------------------------------
            Total |      1,918      100.00
(1,916 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2024-Mar 2025 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          2        0.10        0.10
                . |      1,916       99.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. gen ref_appt_3w=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(1,918 missing values generated)

. replace ref_appt_3w=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt!=.
(2 real changes made)

. lab define ref_appt_3w 1 "Within 3 weeks" 2 "More than 3 weeks", modify

. lab val ref_appt_3w ref_appt_3w

. lab var ref_appt_3w "Time to rheumatology assessment"

. tab ref_appt_3w, missing

          Time to |
     rheumatology |
       assessment |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 3 weeks |          2        0.10        0.10
                . |      1,916       99.90      100.00
------------------+-----------------------------------
            Total |      1,918      100.00

. 
. *Time to EIA code==================================================*/
. 
. **Time from last GP pre-code to EIA code (sensitivity analysis; includes thos
> e with no rheum ref and/or no rheum appt)
. gen time_gp_eia_code = (eia_code_date - last_gp_precode_date) if eia_code_dat
> e!=. & last_gp_precode_date!=. & eia_code_date>=last_gp_precode_date
(1,002 missing values generated)

. tabstat time_gp_eia_code, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~e |       916    178.25     116.5        47     261.5
----------------------------------------------------------------

. 
. **Time from last GP to EIA diagnosis (combined - sensitivity analysis; includ
> es those with no rheum appt)
. gen time_gp_eia_diag = time_gp_rheum_appt
(1,801 missing values generated)

. replace time_gp_eia_diag = time_gp_eia_code if time_gp_rheum_appt==. & time_g
> p_eia_code!=.
(804 real changes made)

. tabstat time_gp_eia_diag, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_ei~g |       921  180.1238       114        48       264
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA code (sensitivity analysis; includes those with 
> no rheum appt)
. gen time_ref_rheum_eia = (eia_code_date - rheum_ref_gp_precode_date) if eia_c
> ode_date!=. & rheum_ref_gp_precode_date!=. & rheum_ref_gp_precode_date<=eia_c
> ode_date  
(1,906 missing values generated)

. tabstat time_ref_rheum_eia, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~a |        12  232.5833       204     109.5       375
----------------------------------------------------------------

. 
. **Time from rheum ref to EIA diagnosis (combined - sensitivity analysis; incl
> udes those with no rheum appt)
. gen time_ref_rheum_eia_comb = time_ref_rheum_appt
(1,916 missing values generated)

. replace time_ref_rheum_eia_comb = time_ref_rheum_eia if time_ref_rheum_appt==
> . & time_ref_rheum_eia!=.
(10 real changes made)

. tabstat time_ref_rheum_eia_comb, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~b |        12  236.0833       204     108.5       375
----------------------------------------------------------------

. 
. **Time from rheum appt to EIA code
. gen time_rheum_eia_code = (eia_code_date - rheum_appt_date) if eia_code_date!
> =. & rheum_appt_date!=. 
(1,662 missing values generated)

. tabstat time_rheum_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_rheum~e |       256  176.4336     182.5      79.5     293.5
----------------------------------------------------------------

. gen time_rheum2_eia_code = (eia_code_date - rheum_appt2_date) if eia_code_dat
> e!=. & rheum_appt2_date!=. 
(1,511 missing values generated)

. tabstat time_rheum2_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
t~2_eia_code |       407  78.26781        88        22       135
----------------------------------------------------------------

. gen time_rheum3_eia_code = (eia_code_date - rheum_appt3_date) if eia_code_dat
> e!=. & rheum_appt3_date!=. 
(1,193 missing values generated)

. tabstat time_rheum3_eia_code, stats (n mean p50 p25 p75) 

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
t~3_eia_code |       725  367.8124       382       209       545
----------------------------------------------------------------

. 
. *Time from rheum appt to first csDMARD prescriptions in primary care record==
> ====================================================================*/
. 
. **Time to first csDMARD script not including high cost MTX prescriptions; pre
> scription must be within 6 months of first rheum appt for all csDMARDs below 
> ==================*/
. gen time_to_csdmard=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_appt
> _date!=. & (csdmard_date<=(rheum_appt_date+180))
(1,816 missing values generated)

. tabstat time_to_csdmard, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~d |       102  53.64706      53.5        -5       115
----------------------------------------------------------------

. 
. **All generate time to first csDMARD script not including high cost MTX presc
> riptions; with no time restriction ==================*/
. gen time_to_csdmard_unr=(csdmard_date-rheum_appt_date) if csdmard==1 & rheum_
> appt_date!=.
(1,740 missing values generated)

. tabstat time_to_csdmard_unr, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
time_to_cs~r |       178  194.5562       141        37       277
----------------------------------------------------------------

. 
. /*
> **Time to first csDMARD script for RA patients (including high cost MTX presc
> riptions)
> gen time_to_csdmard_hcd=(csdmard_hcd_date-rheum_appt_date) if csdmard_hcd==1 
> & rheum_appt_date!=. & (csdmard_hcd_date<=rheum_appt_date+180)
> tabstat time_to_csdmard_hcd if ra_code==1, stats (n mean p50 p25 p75) 
> */
. 
. **csDMARD time categories (not including high cost MTX prescriptions)
. gen csdmard_time=1 if time_to_csdmard<=90 & time_to_csdmard!=. 
(1,851 missing values generated)

. replace csdmard_time=2 if time_to_csdmard>90 & time_to_csdmard<=180 & time_to
> _csdmard!=.
(35 real changes made)

. replace csdmard_time=3 if time_to_csdmard>180 | time_to_csdmard==.
(1,816 real changes made)

. lab define csdmard_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription
>  within 6 months", modify

. lab val csdmard_time csdmard_time

. lab var csdmard_time "csDMARD in primary care, overall" 

. tab csdmard_time, missing

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         67        3.49        3.49
                     3-6 months |         35        1.82        5.32
No prescription within 6 months |      1,816       94.68      100.00
--------------------------------+-----------------------------------
                          Total |      1,918      100.00

. tab csdmard_time if has_6m_follow_up==1, missing

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         62       26.50       26.50
                     3-6 months |         33       14.10       40.60
No prescription within 6 months |        139       59.40      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00

. tab csdmard_time if ra_code==1 & has_6m_follow_up==1, missing 

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         48       25.26       25.26
                     3-6 months |         27       14.21       39.47
No prescription within 6 months |        115       60.53      100.00
--------------------------------+-----------------------------------
                          Total |        190      100.00

. tab csdmard_time if psa_code==1 & has_6m_follow_up==1, missing

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          5       27.78       27.78
                     3-6 months |          5       27.78       55.56
No prescription within 6 months |          8       44.44      100.00
--------------------------------+-----------------------------------
                          Total |         18      100.00

. tab csdmard_time if anksp_code==1 & has_6m_follow_up==1, missing

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          8       36.36       36.36
No prescription within 6 months |         14       63.64      100.00
--------------------------------+-----------------------------------
                          Total |         22      100.00

. tab csdmard_time if undiff_code==1 & has_6m_follow_up==1, missing

       csDMARD in primary care, |
                        overall |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          1       25.00       25.00
                     3-6 months |          1       25.00       50.00
No prescription within 6 months |          2       50.00      100.00
--------------------------------+-----------------------------------
                          Total |          4      100.00

. 
. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.         gen csdmard_time_`start'=csdmard_time if appt_year==`i'
  5.         recode csdmard_time_`start' .=4
  6.     lab define csdmard_time_`start' 1 "Within 3 months" 2 "3-6 months" 3 "
> No prescription within 6 months" 4 "Outside `start'/`end'", modify
  7.         lab val csdmard_time_`start' csdmard_time_`start'
  8.         lab var csdmard_time_`start' "csDMARD in primary care, Apr `start'
> -Mar `end'"
  9.         tab csdmard_time_`start' if has_6m_follow_up==1, missing
 10. }
(1,912 missing values generated)
(csdmard_time_2016: 1912 changes made)

   csDMARD in primary care, Apr |
                  2016-Mar 2017 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          2        0.85        0.85
                     3-6 months |          3        1.28        2.14
No prescription within 6 months |          1        0.43        2.56
              Outside 2016/2017 |        228       97.44      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,913 missing values generated)
(csdmard_time_2017: 1913 changes made)

   csDMARD in primary care, Apr |
                  2017-Mar 2018 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          2        0.85        0.85
No prescription within 6 months |          3        1.28        2.14
              Outside 2017/2018 |        229       97.86      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,912 missing values generated)
(csdmard_time_2018: 1912 changes made)

   csDMARD in primary care, Apr |
                  2018-Mar 2019 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          1        0.43        0.43
No prescription within 6 months |          5        2.14        2.56
              Outside 2018/2019 |        228       97.44      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,914 missing values generated)
(csdmard_time_2019: 1914 changes made)

   csDMARD in primary care, Apr |
                  2019-Mar 2020 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No prescription within 6 months |          4        1.71        1.71
              Outside 2019/2020 |        230       98.29      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,914 missing values generated)
(csdmard_time_2020: 1914 changes made)

   csDMARD in primary care, Apr |
                  2020-Mar 2021 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     3-6 months |          1        0.43        0.43
No prescription within 6 months |          3        1.28        1.71
              Outside 2020/2021 |        230       98.29      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,908 missing values generated)
(csdmard_time_2021: 1908 changes made)

   csDMARD in primary care, Apr |
                  2021-Mar 2022 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     3-6 months |          3        1.28        1.28
No prescription within 6 months |          7        2.99        4.27
              Outside 2021/2022 |        224       95.73      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,874 missing values generated)
(csdmard_time_2022: 1874 changes made)

   csDMARD in primary care, Apr |
                  2022-Mar 2023 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          7        2.99        2.99
                     3-6 months |          8        3.42        6.41
No prescription within 6 months |         29       12.39       18.80
              Outside 2022/2023 |        190       81.20      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,821 missing values generated)
(csdmard_time_2023: 1821 changes made)

   csDMARD in primary care, Apr |
                  2023-Mar 2024 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         28       11.97       11.97
                     3-6 months |         11        4.70       16.67
No prescription within 6 months |         58       24.79       41.45
              Outside 2023/2024 |        137       58.55      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00
(1,844 missing values generated)
(csdmard_time_2024: 1844 changes made)

   csDMARD in primary care, Apr |
                  2024-Mar 2025 |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         17        7.26        7.26
                     3-6 months |          7        2.99       10.26
No prescription within 6 months |         28       11.97       22.22
              Outside 2024/2025 |        182       77.78      100.00
--------------------------------+-----------------------------------
                          Total |        234      100.00

. 
. **csDMARD time categories - binary 6 months
. gen csdmard_6m=1 if time_to_csdmard<=180 & time_to_csdmard!=. 
(1,816 missing values generated)

. replace csdmard_6m=0 if time_to_csdmard>180 | time_to_csdmard==.
(1,816 real changes made)

. lab define csdmard_6m 1 "Yes" 0 "No", modify

. lab val csdmard_6m csdmard_6m

. lab var csdmard_6m "csDMARD in primary care within 6 months" 

. tab csdmard_6m, missing 

 csDMARD in |
    primary |
care within |
   6 months |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,816       94.68       94.68
        Yes |        102        5.32      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. /*
> **csDMARD time categories (including high cost MTX prescriptions)
> gen csdmard_hcd_time=1 if time_to_csdmard_hcd<=90 & time_to_csdmard_hcd!=. 
> replace csdmard_hcd_time=2 if time_to_csdmard_hcd>90 & time_to_csdmard_hcd<=1
> 80 & time_to_csdmard_hcd!=.
> replace csdmard_hcd_time=3 if time_to_csdmard_hcd>180 | time_to_csdmard_hcd==
> .
> lab define csdmard_hcd_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescrip
> tion within 6 months", modify
> lab val csdmard_hcd_time csdmard_hcd_time
> lab var csdmard_hcd_time "csDMARD in primary care" 
> tab csdmard_hcd_time if ra_code==1, missing 
> tab csdmard_hcd_time if psa_code==1, missing
> tab csdmard_hcd_time if anksp_code==1, missing 
> tab csdmard_hcd_time if undiff_code==1, missing
> */
. 
. **What was first csDMARD in GP record (not including high cost MTX prescripti
> ons) - with time restriction - may need to remove leflunomide (for OpenSAFELY
>  report) due to small counts at more granular time periods
. gen first_csD=""
(1,918 missing values generated)

. foreach var of varlist hydroxychloroquine_date mtx_date sulfasalazine_date le
> flunomide_date {
  2.         replace first_csD="`var'" if csdmard_date==`var' & csdmard_date!=.
>  & (`var'<=(rheum_appt_date+180)) & time_to_csdmard!=.
  3.         }
variable first_csD was str1 now str23
(14 real changes made)
(70 real changes made)
(8 real changes made)
(10 real changes made)

. gen first_csDMARD = substr(first_csD, 1, length(first_csD) - 5) if first_csD!
> ="" 
(1,816 missing values generated)

. drop first_csD

. replace first_csDMARD="Methotrexate" if first_csDMARD=="mtx"
(70 real changes made)

. replace first_csDMARD="Sulfasalazine" if first_csDMARD=="sulfasalazine"
(8 real changes made)

. replace first_csDMARD="Hydroxychloroquine" if first_csDMARD=="hydroxychloroqu
> ine" 
(14 real changes made)

. replace first_csDMARD="Leflunomide" if first_csDMARD=="leflunomide" 
(10 real changes made)

. tab first_csDMARD if ra_code==1 //for RA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |         12       14.81       14.81
       Leflunomide |          9       11.11       25.93
      Methotrexate |         53       65.43       91.36
     Sulfasalazine |          7        8.64      100.00
-------------------+-----------------------------------
             Total |         81      100.00

. tab first_csDMARD if psa_code==1 //for PsA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       Leflunomide |          1        9.09        9.09
      Methotrexate |         10       90.91      100.00
-------------------+-----------------------------------
             Total |         11      100.00

. tab first_csDMARD if anksp_code==1 //for axSpA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |          1       12.50       12.50
      Methotrexate |          7       87.50      100.00
-------------------+-----------------------------------
             Total |          8      100.00

. tab first_csDMARD if undiff_code==1 //for Undiff IA patients

     first_csDMARD |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |          1       50.00       50.00
     Sulfasalazine |          1       50.00      100.00
-------------------+-----------------------------------
             Total |          2      100.00

. 
. **What was first csDMARD in GP record (not including high cost MTX prescripti
> ons) - without time restriction
. gen first_csD_unr=""
(1,918 missing values generated)

. foreach var of varlist hydroxychloroquine_date mtx_date sulfasalazine_date le
> flunomide_date {
  2.         replace first_csD_unr="`var'" if csdmard_date==`var' & csdmard_dat
> e!=.
  3.         }
variable first_csD_unr was str1 now str23
(279 real changes made)
(1,094 real changes made)
(168 real changes made)
(144 real changes made)

. gen first_csDMARD_unr = substr(first_csD_unr, 1, length(first_csD_unr) - 5) i
> f first_csD_unr!="" 
(234 missing values generated)

. drop first_csD_unr

. replace first_csDMARD_unr="Methotrexate" if first_csDMARD_unr=="mtx"
(1,093 real changes made)

. replace first_csDMARD_unr="Sulfasalazine" if first_csDMARD_unr=="sulfasalazin
> e"
(168 real changes made)

. replace first_csDMARD_unr="Hydroxychloroquine" if first_csDMARD_unr=="hydroxy
> chloroquine" 
(279 real changes made)

. replace first_csDMARD_unr="Leflunomide" if first_csDMARD_unr=="leflunomide" 
(144 real changes made)

. tab first_csDMARD_unr if ra_code==1 //for RA patients

 first_csDMARD_unr |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |        221       16.20       16.20
       Leflunomide |        113        8.28       24.49
      Methotrexate |        888       65.10       89.59
     Sulfasalazine |        142       10.41      100.00
-------------------+-----------------------------------
             Total |      1,364      100.00

. tab first_csDMARD_unr if psa_code==1 //for PsA patients

 first_csDMARD_unr |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |         30       17.05       17.05
       Leflunomide |         13        7.39       24.43
      Methotrexate |        118       67.05       91.48
     Sulfasalazine |         15        8.52      100.00
-------------------+-----------------------------------
             Total |        176      100.00

. tab first_csDMARD_unr if anksp_code==1 //for axSpA patients

 first_csDMARD_unr |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |         23       19.33       19.33
       Leflunomide |         16       13.45       32.77
      Methotrexate |         72       60.50       93.28
     Sulfasalazine |          8        6.72      100.00
-------------------+-----------------------------------
             Total |        119      100.00

. tab first_csDMARD_unr if undiff_code==1 //for Undiff IA patients

 first_csDMARD_unr |      Freq.     Percent        Cum.
-------------------+-----------------------------------
Hydroxychloroquine |          5       20.00       20.00
       Leflunomide |          2        8.00       28.00
      Methotrexate |         15       60.00       88.00
     Sulfasalazine |          3       12.00      100.00
-------------------+-----------------------------------
             Total |         25      100.00

. 
. /*
> **What was first csDMARD in GP record (including high cost MTX prescriptions)
> gen first_csD_hcd=""
> foreach var of varlist hydroxychloroquine_date methotrexate_date methotrexate
> _hcd_date sulfasalazine_date leflunomide_date {
>         replace first_csD_hcd="`var'" if csdmard_hcd_date==`var' & csdmard_hc
> d_date!=. & (csdmard_hcd_date<=rheum_appt_date+180) & time_to_csdmard_hcd!=.
>         }
> gen first_csDMARD_hcd = substr(first_csD_hcd, 1, length(first_csD_hcd) - 5) i
> f first_csD_hcd!=""
> drop first_csD_hcd
> tab first_csDMARD_hcd if ra_code==1 //for RA patients
> tab first_csDMARD_hcd if psa_code==1 //for PsA patients
> tab first_csDMARD_hcd if anksp_code==1 //for axSpA patients
> tab first_csDMARD_hcd if undiff_code==1 //for Undiff IA patients
> */
.  
. /*
> **Methotrexate use (including high cost MTX prescriptions)
> gen mtx_hcd=1 if methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1
> recode mtx_hcd .=0 
> */
. 
. /*
> **Date of first methotrexate script (including high cost MTX prescriptions)
> gen mtx_hcd_date=min(methotrexate_date, methotrexate_inj_date, methotrexate_h
> cd_date)
> format %td mtx_hcd_date
> */
. 
. **Methotrexate use (not including high cost MTX prescriptions)
. tab mtx if ra_code==1 //for RA patients; Nb. this is just a check; need time-
> to-MTX instead (below)

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        279       17.85       17.85
          1 |      1,284       82.15      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. tab mtx if ra_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-month limit

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        192       13.57       13.57
          1 |      1,223       86.43      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. tab mtx if ra_code==1 & (mtx_date<=rheum_appt_date+365) //with 12-month limit

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        192       13.22       13.22
          1 |      1,260       86.78      100.00
------------+-----------------------------------
      Total |      1,452      100.00

. tab mtx if psa_code==1 //for PsA patients

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         33       16.58       16.58
          1 |        166       83.42      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab mtx if psa_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-month limit

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       13.68       13.68
          1 |        164       86.32      100.00
------------+-----------------------------------
      Total |        190      100.00

. tab mtx if psa_code==1 & (mtx_date<=rheum_appt_date+365) //with 12-month limi
> t

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       13.54       13.54
          1 |        166       86.46      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab mtx if undiff_code==1 //for undiff IA patients

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         25      100.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab mtx if undiff_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-month li
> mit

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23      100.00      100.00
------------+-----------------------------------
      Total |         23      100.00

. tab mtx if undiff_code==1 & (mtx_date<=rheum_appt_date+365) //with 12-month l
> imit

Methotrexat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         24      100.00      100.00
------------+-----------------------------------
      Total |         24      100.00

. 
. /*
> **Methotrexate use (including high cost MTX prescriptions)
> tab mtx_hcd if ra_code==1 //for RA patients
> tab mtx_hcd if ra_code==1 & (mtx_hcd_date<=rheum_appt_date+180) //with 6-mont
> h limit
> tab mtx_hcd if ra_code==1 & (mtx_hcd_date<=rheum_appt_date+365) //with 12-mon
> th limit
> tab mtx_hcd if psa_code==1 //for PsA patients
> tab mtx_hcd if psa_code==1 & (mtx_hcd_date<=rheum_appt_date+180) //with 6-mon
> th limit
> tab mtx_hcd if psa_code==1 & (mtx_hcd_date<=rheum_appt_date+365) //with 12-mo
> nth limit
> tab mtx_hcd if undiff_code==1 //for undiff IA patients
> tab mtx_hcd if undiff_code==1 & (mtx_hcd_date<=rheum_appt_date+180) //with 6-
> month limit
> tab mtx_hcd if undiff_code==1 & (mtx_hcd_date<=rheum_appt_date+365) //with 12
> -month limit
> */
. 
. **Check if medication issued >once
. gen mtx_shared=1 if mtx==1 & (methotrexate_oral_count>1 | methotrexate_inj_co
> unt>1)
(691 missing values generated)

. recode mtx_shared .=0
(mtx_shared: 691 changes made)

. tab mtx_shared

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        691       36.03       36.03
          1 |      1,227       63.97      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **Methotrexate use (shared care)
. tab mtx_shared if ra_code==1 //for RA patients; Nb. this is just a check; nee
> d time-to-MTX instead (below)

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        560       35.83       35.83
          1 |      1,003       64.17      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. tab mtx_shared if ra_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-month
>  limit

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        446       31.52       31.52
          1 |        969       68.48      100.00
------------+-----------------------------------
      Total |      1,415      100.00

. tab mtx_shared if psa_code==1 //for PsA patients

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       38.69       38.69
          1 |        122       61.31      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab mtx_shared if psa_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-mont
> h limit

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       36.84       36.84
          1 |        120       63.16      100.00
------------+-----------------------------------
      Total |        190      100.00

. tab mtx_shared if undiff_code==1 //for undiff IA patients

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       40.00       40.00
          1 |         15       60.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab mtx_shared if undiff_code==1 & (mtx_date<=rheum_appt_date+180) //with 6-m
> onth limit

 mtx_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       34.78       34.78
          1 |         15       65.22      100.00
------------+-----------------------------------
      Total |         23      100.00

. 
. **Check medication issue number
. gen mtx_issue=0 if mtx==1 & (methotrexate_oral_count==0 | methotrexate_inj_co
> unt==0)
(1,418 missing values generated)

. replace mtx_issue=1 if mtx==1 & (methotrexate_oral_count==1 | methotrexate_in
> j_count==1)
(724 real changes made)

. replace mtx_issue=2 if mtx==1 & (methotrexate_oral_count>1 | methotrexate_inj
> _count>1)
(1,227 real changes made)

. tab mtx_issue

  mtx_issue |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        361       22.73       22.73
          2 |      1,227       77.27      100.00
------------+-----------------------------------
      Total |      1,588      100.00

. 
. **Time to first methotrexate script for RA patients (not including high cost 
> MTX prescriptions) - with time restriction for all of the below
. gen time_to_mtx=(mtx_date-rheum_appt_date) if mtx==1 & rheum_appt_date!=. & (
> mtx_date<=rheum_appt_date+180)
(1,836 missing values generated)

. tabstat time_to_mtx if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        62  57.16129      64.5       -17       115
----------------------------------------------------------------

. 
. /*
> **Time to first methotrexate script for RA patients (including high cost MTX 
> prescriptions)
> gen time_to_mtx_hcd=(mtx_hcd_date-rheum_appt_date) if mtx_hcd==1 & rheum_appt
> _date!=. & (mtx_hcd_date<=rheum_appt_date+180)
> tabstat time_to_mtx_hcd if ra_code==1, stats (n mean p50 p25 p75)
> */
. 
. **Time to first methotrexate script for PsA patients (not including high cost
>  MTX prescriptions)
. tabstat time_to_mtx if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |        10      65.3        79        -1       132
----------------------------------------------------------------

. 
. /*
> **Time to first methotrexate script for PsA patients (including high cost MTX
>  prescriptions)
> tabstat time_to_mtx_hcd if psa_code==1, stats (n mean p50 p25 p75)
> */
. 
. **Time to first methotrexate script for Undiff IA patients (not including hig
> h cost MTX prescriptions)
. tabstat time_to_mtx if undiff_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_mtx |         2     104.5     104.5        38       171
----------------------------------------------------------------

. 
. **Methotrexate time categories (not including high-cost MTX)  
. gen mtx_time=1 if time_to_mtx<=90 & time_to_mtx!=. 
(1,866 missing values generated)

. replace mtx_time=2 if time_to_mtx>90 & time_to_mtx<=180 & time_to_mtx!=.
(30 real changes made)

. replace mtx_time=3 if time_to_mtx>180 | time_to_mtx==.
(1,836 real changes made)

. lab define mtx_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription wit
> hin 6 months", modify

. lab val mtx_time mtx_time

. lab var mtx_time "Methotrexate in primary care" 

. tab mtx_time if ra_code==1, missing 

   Methotrexate in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         38        2.43        2.43
                     3-6 months |         24        1.54        3.97
No prescription within 6 months |      1,501       96.03      100.00
--------------------------------+-----------------------------------
                          Total |      1,563      100.00

. tab mtx_time if psa_code==1, missing

   Methotrexate in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          6        3.02        3.02
                     3-6 months |          4        2.01        5.03
No prescription within 6 months |        189       94.97      100.00
--------------------------------+-----------------------------------
                          Total |        199      100.00

. tab mtx_time if undiff_code==1, missing 

   Methotrexate in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          1        4.00        4.00
                     3-6 months |          1        4.00        8.00
No prescription within 6 months |         23       92.00      100.00
--------------------------------+-----------------------------------
                          Total |         25      100.00

. 
. /*
> **Methotrexate time categories for RA patients (including high-cost MTX)
> gen mtx_hcd_time=1 if time_to_mtx_hcd<=90 & time_to_mtx_hcd!=. 
> replace mtx_hcd_time=2 if time_to_mtx_hcd>90 & time_to_mtx_hcd<=180 & time_to
> _mtx_hcd!=.
> replace mtx_hcd_time=3 if time_to_mtx_hcd>180 | time_to_mtx_hcd==.
> lab define mtx_hcd_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription
>  within 6 months", modify
> lab val mtx_hcd_time mtx_hcd_time
> lab var mtx_hcd_time "Methotrexate in primary care" 
> tab mtx_hcd_time if ra_code==1, missing 
> tab mtx_hcd_time if psa_code==1, missing
> tab mtx_hcd_time if undiff_code==1, missing 
> */
. 
. **Sulfasalazine use
. gen ssz=1 if sulfasalazine==1
(1,112 missing values generated)

. recode ssz .=0 
(ssz: 1112 changes made)

. 
. **Time to first sulfasalazine script for RA patients
. gen time_to_ssz=(sulfasalazine_date-rheum_appt_date) if sulfasalazine_date!=.
>  & rheum_appt_date!=. & (sulfasalazine_date<=rheum_appt_date+180)
(1,902 missing values generated)

. tabstat time_to_ssz if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |        14  84.42857     121.5         1       134
----------------------------------------------------------------

. tabstat time_to_ssz if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_ssz |         0         .         .         .         .
----------------------------------------------------------------

. 
. **Sulfasalazine time categories  
. gen ssz_time=1 if time_to_ssz<=90 & time_to_ssz!=. 
(1,912 missing values generated)

. replace ssz_time=2 if time_to_ssz>90 & time_to_ssz<=180 & time_to_ssz!=.
(10 real changes made)

. replace ssz_time=3 if time_to_ssz>180 | time_to_ssz==.
(1,902 real changes made)

. lab define ssz_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription wit
> hin 6 months", modify

. lab val ssz_time ssz_time

. lab var ssz_time "Sulfasalazine in primary care" 

. tab ssz_time if ra_code==1, missing 

  Sulfasalazine in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          5        0.32        0.32
                     3-6 months |          9        0.58        0.90
No prescription within 6 months |      1,549       99.10      100.00
--------------------------------+-----------------------------------
                          Total |      1,563      100.00

. tab ssz_time if psa_code==1, missing

  Sulfasalazine in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No prescription within 6 months |        199      100.00      100.00
--------------------------------+-----------------------------------
                          Total |        199      100.00

. tab ssz_time if undiff_code==1, missing 

  Sulfasalazine in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          1        4.00        4.00
No prescription within 6 months |         24       96.00      100.00
--------------------------------+-----------------------------------
                          Total |         25      100.00

. 
. **Check if medication issued >once
. gen ssz_shared=1 if ssz==1 & sulfasalazine_count>1
(1,629 missing values generated)

. recode ssz_shared .=0
(ssz_shared: 1629 changes made)

. tab ssz_shared

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,629       84.93       84.93
          1 |        289       15.07      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **sulfasalazine use (shared care)
. tab ssz_shared if ra_code==1 

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,326       84.84       84.84
          1 |        237       15.16      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. tab ssz_shared if ra_code==1 & (sulfasalazine_date<=rheum_appt_date+180)

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,137       83.17       83.17
          1 |        230       16.83      100.00
------------+-----------------------------------
      Total |      1,367      100.00

. tab ssz_shared if psa_code==1 

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        172       86.43       86.43
          1 |         27       13.57      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab ssz_shared if psa_code==1 & (sulfasalazine_date<=rheum_appt_date+180) 

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        153       85.00       85.00
          1 |         27       15.00      100.00
------------+-----------------------------------
      Total |        180      100.00

. tab ssz_shared if undiff_code==1

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         24       96.00       96.00
          1 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab ssz_shared if undiff_code==1 & (sulfasalazine_date<=rheum_appt_date+180)

 ssz_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       95.45       95.45
          1 |          1        4.55      100.00
------------+-----------------------------------
      Total |         22      100.00

. 
. **Check medication issue number
. gen ssz_issue=0 if ssz==1 & sulfasalazine_count==0 
(1,918 missing values generated)

. replace ssz_issue=1 if ssz==1 & sulfasalazine_count==1 
(517 real changes made)

. replace ssz_issue=2 if ssz==1 & sulfasalazine_count>1
(289 real changes made)

. tab ssz_issue

  ssz_issue |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        517       64.14       64.14
          2 |        289       35.86      100.00
------------+-----------------------------------
      Total |        806      100.00

. 
. **Hydroxychloroquine use
. gen hcq=1 if hydroxychloroquine==1
(854 missing values generated)

. recode hcq .=0 
(hcq: 854 changes made)

. 
. **Time to first hydroxychloroquine script for RA patients
. gen time_to_hcq=(hydroxychloroquine_date-rheum_appt_date) if hydroxychloroqui
> ne_date!=. & rheum_appt_date!=. & (hydroxychloroquine_date<=rheum_appt_date+1
> 80)
(1,900 missing values generated)

. tabstat time_to_hcq if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |        16        54      55.5         4       111
----------------------------------------------------------------

. tabstat time_to_hcq if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_hcq |         0         .         .         .         .
----------------------------------------------------------------

. 
. **Hydroxychloroquine time categories  
. gen hcq_time=1 if time_to_hcq<=90 & time_to_hcq!=. 
(1,906 missing values generated)

. replace hcq_time=2 if time_to_hcq>90 & time_to_hcq<=180 & time_to_hcq!=.
(6 real changes made)

. replace hcq_time=3 if time_to_hcq>180 | time_to_hcq==.
(1,900 real changes made)

. lab define hcq_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription wit
> hin 6 months", modify

. lab val hcq_time hcq_time

. lab var hcq_time "Hydroxychloroquine in primary care" 

. tab hcq_time if ra_code==1, missing 

  Hydroxychloroquine in primary |
                           care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |         11        0.70        0.70
                     3-6 months |          5        0.32        1.02
No prescription within 6 months |      1,547       98.98      100.00
--------------------------------+-----------------------------------
                          Total |      1,563      100.00

. tab hcq_time if psa_code==1, missing

  Hydroxychloroquine in primary |
                           care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No prescription within 6 months |        199      100.00      100.00
--------------------------------+-----------------------------------
                          Total |        199      100.00

. tab hcq_time if undiff_code==1, missing 

  Hydroxychloroquine in primary |
                           care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     3-6 months |          1        4.00        4.00
No prescription within 6 months |         24       96.00      100.00
--------------------------------+-----------------------------------
                          Total |         25      100.00

. 
. **Check if medication issued >once
. gen hcq_shared=1 if hcq==1 & hydroxychloroquine_count>1
(1,389 missing values generated)

. recode hcq_shared .=0
(hcq_shared: 1389 changes made)

. tab hcq_shared

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,389       72.42       72.42
          1 |        529       27.58      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **hydroxychloroquine use (shared care)
. tab hcq_shared if ra_code==1 

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,130       72.30       72.30
          1 |        433       27.70      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. tab hcq_shared if ra_code==1 & (hydroxychloroquine_date<=rheum_appt_date+180)

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        954       69.69       69.69
          1 |        415       30.31      100.00
------------+-----------------------------------
      Total |      1,369      100.00

. tab hcq_shared if psa_code==1 

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        151       75.88       75.88
          1 |         48       24.12      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab hcq_shared if psa_code==1 & (hydroxychloroquine_date<=rheum_appt_date+180
> ) 

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        133       73.89       73.89
          1 |         47       26.11      100.00
------------+-----------------------------------
      Total |        180      100.00

. tab hcq_shared if undiff_code==1

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         16       64.00       64.00
          1 |          9       36.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab hcq_shared if undiff_code==1 & (hydroxychloroquine_date<=rheum_appt_date+
> 180)

 hcq_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         14       63.64       63.64
          1 |          8       36.36      100.00
------------+-----------------------------------
      Total |         22      100.00

. 
. **Check medication issue number
. gen hcq_issue=0 if hcq==1 & hydroxychloroquine_count==0 
(1,918 missing values generated)

. replace hcq_issue=1 if hcq==1 & hydroxychloroquine_count==1 
(535 real changes made)

. replace hcq_issue=2 if hcq==1 & hydroxychloroquine_count>1
(529 real changes made)

. tab hcq_issue

  hcq_issue |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        535       50.28       50.28
          2 |        529       49.72      100.00
------------+-----------------------------------
      Total |      1,064      100.00

. 
. **Leflunomide use
. gen lef=1 if leflunomide==1
(1,239 missing values generated)

. recode lef .=0 
(lef: 1239 changes made)

. 
. **Time to first leflunomide script for RA patients
. gen time_to_lef=(leflunomide_date-rheum_appt_date) if leflunomide_date!=. & r
> heum_appt_date!=. & (leflunomide_date<=rheum_appt_date+180)
(1,901 missing values generated)

. tabstat time_to_lef if ra_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |        15  99.46667       135        19       154
----------------------------------------------------------------

. tabstat time_to_lef if psa_code==1, stats (n mean p50 p25 p75)

    variable |         N      mean       p50       p25       p75
-------------+--------------------------------------------------
 time_to_lef |         2      70.5      70.5        26       115
----------------------------------------------------------------

. 
. **Leflunomide time categories  
. gen lef_time=1 if time_to_lef<=90 & time_to_lef!=. 
(1,911 missing values generated)

. replace lef_time=2 if time_to_lef>90 & time_to_lef<=180 & time_to_lef!=.
(10 real changes made)

. replace lef_time=3 if time_to_lef>180 | time_to_lef==.
(1,901 real changes made)

. lab define lef_time 1 "Within 3 months" 2 "3-6 months" 3 "No prescription wit
> hin 6 months", modify

. lab val lef_time lef_time

. lab var lef_time "Leflunomide in primary care" 

. tab lef_time if ra_code==1, missing 

    Leflunomide in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          6        0.38        0.38
                     3-6 months |          9        0.58        0.96
No prescription within 6 months |      1,548       99.04      100.00
--------------------------------+-----------------------------------
                          Total |      1,563      100.00

. tab lef_time if psa_code==1, missing

    Leflunomide in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                Within 3 months |          1        0.50        0.50
                     3-6 months |          1        0.50        1.01
No prescription within 6 months |        197       98.99      100.00
--------------------------------+-----------------------------------
                          Total |        199      100.00

. tab lef_time if undiff_code==1, missing 

    Leflunomide in primary care |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No prescription within 6 months |         25      100.00      100.00
--------------------------------+-----------------------------------
                          Total |         25      100.00

. 
. **Check if medication issued >once
. gen lef_shared=1 if lef==1 & leflunomide_count>1
(1,718 missing values generated)

. recode lef_shared .=0
(lef_shared: 1718 changes made)

. tab lef_shared

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,718       89.57       89.57
          1 |        200       10.43      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **leflunomide use (shared care)
. tab lef_shared if ra_code==1 

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,394       89.19       89.19
          1 |        169       10.81      100.00
------------+-----------------------------------
      Total |      1,563      100.00

. tab lef_shared if ra_code==1 & (leflunomide_date<=rheum_appt_date+180)

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,205       88.08       88.08
          1 |        163       11.92      100.00
------------+-----------------------------------
      Total |      1,368      100.00

. tab lef_shared if psa_code==1 

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        182       91.46       91.46
          1 |         17        8.54      100.00
------------+-----------------------------------
      Total |        199      100.00

. tab lef_shared if psa_code==1 & (leflunomide_date<=rheum_appt_date+180) 

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        165       90.66       90.66
          1 |         17        9.34      100.00
------------+-----------------------------------
      Total |        182      100.00

. tab lef_shared if undiff_code==1

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         23       92.00       92.00
          1 |          2        8.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab lef_shared if undiff_code==1 & (leflunomide_date<=rheum_appt_date+180)

 lef_shared |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         19       90.48       90.48
          1 |          2        9.52      100.00
------------+-----------------------------------
      Total |         21      100.00

. 
. **Check medication issue number
. gen lef_issue=0 if lef==1 & leflunomide_count==0 
(1,918 missing values generated)

. replace lef_issue=1 if lef==1 & leflunomide_count==1 
(479 real changes made)

. replace lef_issue=2 if lef==1 & leflunomide_count>1
(200 real changes made)

. tab lef_issue

  lef_issue |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        479       70.54       70.54
          2 |        200       29.46      100.00
------------+-----------------------------------
      Total |        679      100.00

. 
. **For all csDMARDs, check if issued more than once 
. gen csdmard_shared=1 if lef_shared==1 | mtx_shared==1 | hcq_shared==1 | ssz_s
> hared==1 
(611 missing values generated)

. recode csdmard_shared .=0
(csdmard_shared: 611 changes made)

. tab csdmard_shared

csdmard_sha |
        red |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        611       31.86       31.86
          1 |      1,307       68.14      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. tab csdmard //for comparison

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        234       12.20       12.20
          1 |      1,684       87.80      100.00
------------+-----------------------------------
      Total |      1,918      100.00

. 
. **Time to first biologic script; high_cost drug data available to Nov 2020. N
> ot for analysis currently due to small numbers===============================
> =======================================*/
. 
. /* 
> *Below analyses are only for patients with at least 12 months of follow-up av
> ailable after rheum appt
> gen time_to_biologic=(biologic_date-rheum_appt_date) if biologic==1 & rheum_a
> ppt_date!=. & (biologic_date<=rheum_appt_date+365)
> tabstat time_to_biologic, stats (n mean p50 p25 p75) //for all EIA patients
> 
> 
> **What was first biologic
> gen first_bio=""
> foreach var of varlist abatacept_date adalimumab_date baricitinib_date certol
> izumab_date etanercept_date golimumab_date guselkumab_date infliximab_date ix
> ekizumab_date rituximab_date sarilumab_date secukinumab_date tocilizumab_date
>  tofacitinib_date upadacitinib_date ustekinumab_date {
>         replace first_bio="`var'" if biologic_date==`var' & biologic_date!=.
>         }
> gen first_biologic = substr(first_bio, 1, length(first_bio) - 5)        
> drop first_bio
> tab first_biologic //for all EIA patients
> 
> **Biologic time categories (for all patients)
> gen biologic_time=1 if time_to_biologic<=180 & time_to_biologic!=. 
> replace biologic_time=2 if time_to_biologic>180 & time_to_biologic<=365 & tim
> e_to_biologic!=.
> replace biologic_time=3 if time_to_biologic>365 | time_to_biologic==.
> lab define biologic_time 1 "Within 6 months" 2 "6-12 months" 3 "No prescripti
> on within 12 months", modify
> lab val biologic_time biologic_time
> lab var biologic_time "bDMARD/tsDMARD prescription" 
> tab biologic_time
> 
> **Biologic time categories (by year)
> bys diagnosis_6m: tab biologic_time
> */
. 
. save "$projectdir/output/data/file_eia_all", replace
(note: file /workspace/output/data/file_eia_all.dta not found)
file /workspace/output/data/file_eia_all.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cleaning_dataset.log
  log type:  text
 closed on:  22 May 2025, 15:33:26
-------------------------------------------------------------------------------
